{
  "videos": [
    {
      "id": "7065096379357515054",
      "text": "",
      "stats": {
        "commentCount": 17,
        "diggCount": 488,
        "playCount": 2127,
        "shareCount": 28,
        "engagementRate": 0.25058768218147626
      },
      "index": 0
    },
    {
      "id": "7063166213912022319",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 9,
        "diggCount": 659,
        "playCount": 2736,
        "shareCount": 17,
        "engagementRate": 0.2503654970760234
      },
      "index": 1
    },
    {
      "id": "7069492375604710699",
      "text": " Want to naturally boost testosterone? Me too!",
      "stats": {
        "commentCount": 16,
        "diggCount": 522,
        "playCount": 2611,
        "shareCount": 18,
        "engagementRate": 0.21294523171198773
      },
      "index": 2
    },
    {
      "id": "7066616573540420911",
      "text": " I miss the golden era of aesthetics.",
      "stats": {
        "commentCount": 19,
        "diggCount": 2150,
        "playCount": 10800,
        "shareCount": 21,
        "engagementRate": 0.20277777777777778
      },
      "index": 3
    },
    {
      "id": "7082085154532937006",
      "text": " So you're chasing aesthetics. Well, so are we. Welcome to the cult.",
      "stats": {
        "commentCount": 3,
        "diggCount": 709,
        "playCount": 3790,
        "shareCount": 22,
        "engagementRate": 0.19366754617414247
      },
      "index": 4
    },
    {
      "id": "7067593445623401775",
      "text": " I just want to skip this class and get a disgusting leg bump.",
      "stats": {
        "commentCount": 32,
        "diggCount": 878,
        "playCount": 4892,
        "shareCount": 19,
        "engagementRate": 0.18990188062142274
      },
      "index": 5
    },
    {
      "id": "7062427849411562799",
      "text": " Yo, I don't know why nobody's talking about the negative side effects of taking creatine and protein powder at the exact same time, but as you can see from this photo right here, I got extremely jacked from doing it. This stuff is really dangerous guys, we gotta tell more people about it.",
      "stats": {
        "commentCount": 17,
        "diggCount": 496,
        "playCount": 2866,
        "shareCount": 16,
        "engagementRate": 0.1845778087927425
      },
      "index": 6
    },
    {
      "id": "7166344540054457646",
      "text": " Here are the top 3 exercises I regret doing most. Number 1, lateral raises. After spamming these, I now cannot fit through most doorways. Number 2, lat pull downs. These made my lats overly massive, so now whenever there's a gust of wind, I fly away. And number 3, hack squats. These gave me juicy quads and an absolute dumpy, so now I can't fit into any of my pants and I get objectified by my gym bros.",
      "stats": {
        "commentCount": 149,
        "diggCount": 63400,
        "playCount": 346200,
        "shareCount": 197,
        "engagementRate": 0.18413056036972847
      },
      "index": 7
    },
    {
      "id": "7102137780838436138",
      "text": " Whatever it takes!",
      "stats": {
        "commentCount": 18,
        "diggCount": 781,
        "playCount": 4471,
        "shareCount": 20,
        "engagementRate": 0.18318049653321405
      },
      "index": 8
    },
    {
      "id": "7184847934612147499",
      "text": " well your biceps are fatter than a cafeteria lady the number one forbidden rule of the gym is to never make your homie laugh during a set my friend made me bust out laughing during a benchpr once i swear i thought i saw god for a second send this to the person who decides to become a stand-up comedian when you start a set",
      "stats": {
        "commentCount": 4636,
        "diggCount": 403200,
        "playCount": 2300000,
        "shareCount": 11200,
        "engagementRate": 0.1821895652173913
      },
      "index": 9
    },
    {
      "id": "7109917377680330030",
      "text": " I've been seeing this trend recently all over my 4U page. I know a lot of people are joking with this, but you gotta understand that there's a lot of young kids on this app. Taking trend or any form of steroids or PEDs before you finish puberty is extremely dangerous. You are quite literally permanently changing your hormones before your body's finished developing. Not to mention you can't get this stuff legally at your age, so whoever you're getting it from, you have no idea what's in it. Taking PEDs before you're old enough can stunt your growth, anything from height to you know what. These videos are jokes but please stay safe guys.",
      "stats": {
        "commentCount": 17,
        "diggCount": 344,
        "playCount": 2174,
        "shareCount": 34,
        "engagementRate": 0.18169273229070837
      },
      "index": 10
    },
    {
      "id": "7083883999566794030",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 8,
        "diggCount": 1552,
        "playCount": 8979,
        "shareCount": 36,
        "engagementRate": 0.17774807885065153
      },
      "index": 11
    },
    {
      "id": "7165199816513932586",
      "text": " 🎵",
      "stats": {
        "commentCount": 84,
        "diggCount": 10600,
        "playCount": 62800,
        "shareCount": 175,
        "engagementRate": 0.1729140127388535
      },
      "index": 12
    },
    {
      "id": "7108838743301442862",
      "text": " Bye, bye, bye, bye, bye, bye, bye.",
      "stats": {
        "commentCount": 100,
        "diggCount": 507,
        "playCount": 3674,
        "shareCount": 19,
        "engagementRate": 0.17038649972781708
      },
      "index": 13
    },
    {
      "id": "7172629177328340270",
      "text": " Here are the top 3 exercises I regret doing most. Number 1, chest flies. After spamming these, my cup size is now bigger than any girl I talk to. Number 2, tricep extensions. These gave me massive triceps so now I can't walk past mirrors without flexing. And number 3, hip thrust. I acquired an absolute dumpy from this exercise so now I get violated by my gym bros.",
      "stats": {
        "commentCount": 133,
        "diggCount": 86500,
        "playCount": 510100,
        "shareCount": 239,
        "engagementRate": 0.17030386198784553
      },
      "index": 14
    },
    {
      "id": "7091349339645168938",
      "text": " But if you're looking for something new, I know somebody that you can choose. What about me? What about me? What about me and you?",
      "stats": {
        "commentCount": 10,
        "diggCount": 441,
        "playCount": 2805,
        "shareCount": 25,
        "engagementRate": 0.1696969696969697
      },
      "index": 15
    },
    {
      "id": "7088756351526096174",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 9,
        "diggCount": 533,
        "playCount": 3400,
        "shareCount": 24,
        "engagementRate": 0.16647058823529412
      },
      "index": 16
    },
    {
      "id": "7083223409097854250",
      "text": " If you're not training near failure, you simply won't grow.",
      "stats": {
        "commentCount": 10,
        "diggCount": 354,
        "playCount": 2297,
        "shareCount": 18,
        "engagementRate": 0.16630387461906834
      },
      "index": 17
    },
    {
      "id": "7111318694566907179",
      "text": " Incline barbell. The reason why we're starting with this is to hit the upper chest. You guys need to stop skipping incline barbell press. A lot of you skinny guys struggle with that fullness of the chest. I dealt with this too. Bet a lot of you guys are in the same bone as I was and can't really get that 3D chest that you want. What really made the difference and brought me where I am today is targeting that upper chest with incline press. The difference you will see doing these after just a month is night and day.",
      "stats": {
        "commentCount": 12,
        "diggCount": 409,
        "playCount": 2677,
        "shareCount": 21,
        "engagementRate": 0.1651101979828166
      },
      "index": 18
    },
    {
      "id": "7105135642459442478",
      "text": " Get in the gym! You have to make sure you're bigger than her newbie, Ed!",
      "stats": {
        "commentCount": 9,
        "diggCount": 355,
        "playCount": 2345,
        "shareCount": 20,
        "engagementRate": 0.16375266524520257
      },
      "index": 19
    },
    {
      "id": "7090231905735413034",
      "text": " What she's trying to say... IS WE GO CHAMP! WE GO CHAMP! We go CHAMP!",
      "stats": {
        "commentCount": 17,
        "diggCount": 535,
        "playCount": 3554,
        "shareCount": 26,
        "engagementRate": 0.1626336522228475
      },
      "index": 20
    },
    {
      "id": "7185234481790356778",
      "text": " Everybody thinks that dudes go to the gym six days a week to look like some massive bodybuilder. Like no, the ultimate goal is to look absolutely majestic without even flexing. I swear, David Lay took over the entire fitness industry and he only has like two poses.",
      "stats": {
        "commentCount": 61,
        "diggCount": 39200,
        "playCount": 242900,
        "shareCount": 97,
        "engagementRate": 0.16203375874845616
      },
      "index": 21
    },
    {
      "id": "7106217746433625387",
      "text": " But if you're looking for something new, I know somebody who you can choose. What about me?",
      "stats": {
        "commentCount": 16,
        "diggCount": 813,
        "playCount": 5329,
        "shareCount": 32,
        "engagementRate": 0.16156877462938637
      },
      "index": 22
    },
    {
      "id": "7188919721104870702",
      "text": " What does he mean that the weights are lighter? Dang, he's doing a full stack, what, he's gonna do a cable curl?",
      "stats": {
        "commentCount": 159,
        "diggCount": 97400,
        "playCount": 615400,
        "shareCount": 504,
        "engagementRate": 0.15934839129021774
      },
      "index": 23
    },
    {
      "id": "7163301403232980266",
      "text": " And I hope you fuck it Now what's the word, captain? This just shows how much genetics play a role in your physique. A very large majority of you watching this would spam lateral raises every single day and your delts will still not even come close to this. For example, Dylan O'Brien. This guy just has absolutely insane genetics.",
      "stats": {
        "commentCount": 36,
        "diggCount": 12100,
        "playCount": 78000,
        "shareCount": 35,
        "engagementRate": 0.15603846153846154
      },
      "index": 24
    },
    {
      "id": "7138904063831264555",
      "text": " gets me going I have no idea what she just said but bro in the back is doing foosball crunches",
      "stats": {
        "commentCount": 917,
        "diggCount": 291400,
        "playCount": 1900000,
        "shareCount": 2882,
        "engagementRate": 0.1553678947368421
      },
      "index": 25
    },
    {
      "id": "7186321419188440363",
      "text": " Here are the top 3 exercises to never show your girlfriend. Number 1, calf raises. These will give her big powerful calves so she'll get even better at jumping to conclusions. Number 2, bench press. She might not be able to push as much weight, but she is still strong enough to push you over the edge. And finally, number 3, cheat curls. It has the word cheat in the name, you don't want to be putting these ideas in her head.",
      "stats": {
        "commentCount": 39,
        "diggCount": 8809,
        "playCount": 59000,
        "shareCount": 168,
        "engagementRate": 0.1528135593220339
      },
      "index": 26
    },
    {
      "id": "7108465609423375662",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 16,
        "diggCount": 406,
        "playCount": 2977,
        "shareCount": 29,
        "engagementRate": 0.1514947934161908
      },
      "index": 27
    },
    {
      "id": "7090604151293480238",
      "text": " Baby I wanna touch you I wanna breathe into your world Sustainable",
      "stats": {
        "commentCount": 20,
        "diggCount": 768,
        "playCount": 5328,
        "shareCount": 19,
        "engagementRate": 0.15146396396396397
      },
      "index": 28
    },
    {
      "id": "7186701299394759982",
      "text": " It's not so bad, it's not so bad We all know skipping legs is a heinous crime, but playing fitness has gone too far. Now when you set off the lung alarm, not only will you be judged by everybody else in the gym, but you'll also be judged under the court of law.",
      "stats": {
        "commentCount": 22,
        "diggCount": 3423,
        "playCount": 23200,
        "shareCount": 36,
        "engagementRate": 0.15004310344827587
      },
      "index": 29
    },
    {
      "id": "7108107911863242030",
      "text": " Wake up to reality",
      "stats": {
        "commentCount": 13,
        "diggCount": 423,
        "playCount": 3048,
        "shareCount": 18,
        "engagementRate": 0.1489501312335958
      },
      "index": 30
    },
    {
      "id": "7175534807059828010",
      "text": " Big shoulders will make you look jacked even with a shirt on. So here are three of the best shoulder exercises. Overhead press for front delts, lateral raises for side delts, and reverse flys for rear delts. Heavy and controlled 3 sets of ages 12 reps. Heavy and controlled 4 sets of ages 12 reps.",
      "stats": {
        "commentCount": 356,
        "diggCount": 237400,
        "playCount": 1600000,
        "shareCount": 555,
        "engagementRate": 0.148944375
      },
      "index": 31
    },
    {
      "id": "7085841614542753070",
      "text": " It's always the people with no profiles that hate the most.",
      "stats": {
        "commentCount": 55,
        "diggCount": 886,
        "playCount": 6428,
        "shareCount": 14,
        "engagementRate": 0.1485687616677038
      },
      "index": 32
    },
    {
      "id": "7157709485933645102",
      "text": " tricep kickback. Use a lighter weight and focus more on your form. They definitely just have Noel reading scripts at this point. If you think this dude is doing tricep kickbacks in the gym, just go ahead and follow my page. I'll get you jacked, I promise.",
      "stats": {
        "commentCount": 102,
        "diggCount": 55300,
        "playCount": 374200,
        "shareCount": 36,
        "engagementRate": 0.1481507215392838
      },
      "index": 33
    },
    {
      "id": "7112074225711795502",
      "text": " the time. I don't train for strength, I train for aesthetic. When people say they train for aesthetics and not strength, they don't mean that they're not trying to get strong at all. What they're saying is strength and how much they can lift is not really their priority, but rather specifically size and muscle hypertrophy. Yes, there are two different training styles to achieve either one of these outcomes. This is why powerlifters have very different workout regimens than bodybuilders. Of course you're going to get stronger with size, but that's not really the main focus of people who are training for aesthetics.",
      "stats": {
        "commentCount": 23,
        "diggCount": 624,
        "playCount": 4600,
        "shareCount": 23,
        "engagementRate": 0.14565217391304347
      },
      "index": 34
    },
    {
      "id": "7175535917061442858",
      "text": " is leaving my wife and kids optimal. Yes, even though walking away from your wife and kids is cardio, and we all know cardio kills your gains, think about all of the protein that they're probably stealing from you. And not to mention, you're probably spending a lot of time with your wife and kids that you could be spending at the gym.",
      "stats": {
        "commentCount": 36,
        "diggCount": 7640,
        "playCount": 54000,
        "shareCount": 119,
        "engagementRate": 0.14435185185185184
      },
      "index": 35
    },
    {
      "id": "7156274177413041454",
      "text": " go to sleep remind yourself you a bitch when you wake up remind yourself you a bitch i am all for training until failure but bro looks like he is crying out to god our man looks like he lost a loved one during this set train hard just maybe not this hard",
      "stats": {
        "commentCount": 61,
        "diggCount": 14600,
        "playCount": 102700,
        "shareCount": 84,
        "engagementRate": 0.14357351509250244
      },
      "index": 36
    },
    {
      "id": "7188548576853626155",
      "text": " a low budget grocery haul of exactly what I eat as somebody who's trying to gain as much muscle as possible. All of this came out to about $80 and this should last me about two weeks which means I'm spending less than two dollars per meal. Alright for proteins we got two pounds of ground beef, I have two pounds of shredded beef, I have a pound and a half of chicken, an entire bag of air fried chicken nuggets. These are anabolic despite what people try to tell you and I got this huge 12-pack of greek yogurts. I also got an entire rotisserie chicken that I'm eating for dinner tonight because they look good and I'm fat. Oh and you can't forget the eggs. For carbs we got pasta, instant mashed potatoes, we got regular bread, we got bagels, tortillas, and last but not least beans. I also got a few other miscellaneous things we got sweet and sour sauce, tomato sauce, we got some pasta sauce, lettuce, bananas, onions, and cheese. Body building doesn't have to be expensive you just gotta know what to get.",
      "stats": {
        "commentCount": 47,
        "diggCount": 3706,
        "playCount": 26800,
        "shareCount": 71,
        "engagementRate": 0.1426865671641791
      },
      "index": 37
    },
    {
      "id": "7126609206261583147",
      "text": " Recently, the Inclined Bicep Curl started to gain a lot of popularity. This leads to the question, is it actually good and should you be doing it? Well the Inclined Curl actually targets the long head of the bicep, so it makes up a lot of that outer fullness of the bicep. And what makes it different from a standard bicep curl is essentially the range of motion. In this upwards position, your arms are down to your side and actually limits the amount of stretch that you're able to get on the long head of the bicep. Doing an Inclined Curl allows that arm to come back behind the body to get a full stretch on the long head. This is an amazing exercise to tear down those muscle fibers and build big biceps.",
      "stats": {
        "commentCount": 30,
        "diggCount": 3185,
        "playCount": 23000,
        "shareCount": 43,
        "engagementRate": 0.14165217391304347
      },
      "index": 38
    },
    {
      "id": "7174837494477770030",
      "text": " like doing Bulgarian split squats, well guess what? This is gonna make you dislike them even more. Give this a shot during your next leg. Okay, here's my problem with this. There is no doubt that Bulgarian split squats are one of the best exercises to build your quads. And what he showed in this video will grow your quads. However, this is hands down the most painful exercise you can do in the gym. 99% of you watching, and me included, are not doing this. He does a triple drop set with four separate holes. Not only will this feel horrendous, but if you physically can't walk the next few days, that might hinder your gains more than help them.",
      "stats": {
        "commentCount": 50,
        "diggCount": 10900,
        "playCount": 78400,
        "shareCount": 44,
        "engagementRate": 0.1402295918367347
      },
      "index": 39
    },
    {
      "id": "7166340892163312939",
      "text": " How much are these going for? 17K. Is it what? 17K.",
      "stats": {
        "commentCount": 43,
        "diggCount": 4462,
        "playCount": 32900,
        "shareCount": 55,
        "engagementRate": 0.1386018237082067
      },
      "index": 40
    },
    {
      "id": "7082854275201912110",
      "text": " Why do school, work, crypto, tick tock and still have time to go to the gym there's honestly no excuse.",
      "stats": {
        "commentCount": 22,
        "diggCount": 552,
        "playCount": 4259,
        "shareCount": 15,
        "engagementRate": 0.13829537450105658
      },
      "index": 41
    },
    {
      "id": "7089854066318200107",
      "text": " All I am is a man I want the world in my hands",
      "stats": {
        "commentCount": 5,
        "diggCount": 631,
        "playCount": 4779,
        "shareCount": 19,
        "engagementRate": 0.13705796191671898
      },
      "index": 42
    },
    {
      "id": "7166689832314506542",
      "text": " Here are the top 3 benefits I experienced after getting jacked. Number 1, girls. So after I got jacked, I would just get like a ton of girl- well I guess I don't actually talk to any girls. Number 2, happiness. Ever since I got jacked, my mood levels have just been so uh- well I guess I'm actually kinda depressed. Number 3, health. Going to the gym has just made me such a healthier purse. I mean I did kinda binge on that Panda Express last night.",
      "stats": {
        "commentCount": 46,
        "diggCount": 5407,
        "playCount": 40400,
        "shareCount": 54,
        "engagementRate": 0.13631188118811882
      },
      "index": 43
    },
    {
      "id": "7094695465534393646",
      "text": " And now you're gonna drop on me again",
      "stats": {
        "commentCount": 8,
        "diggCount": 420,
        "playCount": 3284,
        "shareCount": 18,
        "engagementRate": 0.13580998781973203
      },
      "index": 44
    },
    {
      "id": "7164072252231945518",
      "text": " This dude just created a Smith machine with a skateboard. For all of you guys asking me about home workouts, try this one out. Let me know how it goes.",
      "stats": {
        "commentCount": 21,
        "diggCount": 4962,
        "playCount": 37200,
        "shareCount": 46,
        "engagementRate": 0.13518817204301076
      },
      "index": 45
    },
    {
      "id": "7187453670370594094",
      "text": " Here are the top five supplements that can help you build muscle. Number one, protein powder. Number two, creatine. Number three, pre-workout. Number four, fish oil. And number five, magnesium. Honorable mention, Trey.",
      "stats": {
        "commentCount": 94,
        "diggCount": 9022,
        "playCount": 68700,
        "shareCount": 133,
        "engagementRate": 0.1346288209606987
      },
      "index": 46
    },
    {
      "id": "7066974730494184750",
      "text": " The best supplements for building muscle.",
      "stats": {
        "commentCount": 8,
        "diggCount": 285,
        "playCount": 2317,
        "shareCount": 16,
        "engagementRate": 0.13336210617177385
      },
      "index": 47
    },
    {
      "id": "7102137265022979371",
      "text": " Oh no, no, no! No, no, no!",
      "stats": {
        "commentCount": 9,
        "diggCount": 316,
        "playCount": 2621,
        "shareCount": 23,
        "engagementRate": 0.1327737504769172
      },
      "index": 48
    },
    {
      "id": "7163734751600282923",
      "text": " I have a really high metabolism and I just can't put on any muscle. You do not have a fast metabolism, you are just not eating enough. Before you put in the comments, Nick, I eat 5000 calories a day, but I'm still only 120 pounds. You're telling me that you eat more calories than one of the biggest bodybuilders right now. You at 120 pounds are eating more calories than this guy. The reason why you think you eat a ton of calories every day is probably because you have lower hunger signaling, which means it feels like you're eating a ton of food because you're getting really full, but if you were to actually go back and properly track those calories it would not be as much as you think it is. Track TNF, tag JPG, they will all stand with me on this. Source, trust me bro, and the Harvard School of Medicine.",
      "stats": {
        "commentCount": 107,
        "diggCount": 6122,
        "playCount": 47900,
        "shareCount": 125,
        "engagementRate": 0.13265135699373695
      },
      "index": 49
    },
    {
      "id": "7184854726847008042",
      "text": " Nobody cares how big your chest is because it's a small muscle. Incline press to target the upper chest. Flat press to target the mid chest. Cable flys to target the mid to lower chest. You can use barbells, dumbbells, or machines. Heavy and controlled 3 sets of 8-12 reps.",
      "stats": {
        "commentCount": 54,
        "diggCount": 6055,
        "playCount": 46600,
        "shareCount": 68,
        "engagementRate": 0.13255364806866954
      },
      "index": 50
    },
    {
      "id": "7106180195803008299",
      "text": " Got this comment on my face transformation video. It dawned on me that a lot of people are actually unsure on what a proper cut looks like. In order to cut, you have to be in a caloric deficit, which means you're eating less calories than you're actually burning. And I see a lot of people make the mistake of cutting too many calories too quickly. I've been guilty of this myself and I've lost a lot of muscle in the process. Ideally, you want to cut slowly to about a 200 to 400 calorie deficit underneath your maintenance. Anything above 500 calories is kind of pushing it. Yes, you will lose fat, but you're also going to be losing a lot of muscle in the process. Let me know in the comments if you guys want tips for cutting or what foods to make cutting easier.",
      "stats": {
        "commentCount": 5,
        "diggCount": 70,
        "playCount": 745,
        "shareCount": 23,
        "engagementRate": 0.13154362416107382
      },
      "index": 51
    },
    {
      "id": "7175225201796468010",
      "text": " Last time I got into a fight was a fist fight with my mom's ex-boyfriend. And that was when I was 16. Whoa. Hahahaha. I'm sorry, but who has the courage to fight Larry Wheels? His laugh has 100 grams of protein alone. This dude was benching 400 pounds at 16 years old, I'm good.",
      "stats": {
        "commentCount": 52,
        "diggCount": 7836,
        "playCount": 60400,
        "shareCount": 52,
        "engagementRate": 0.1314569536423841
      },
      "index": 52
    },
    {
      "id": "7110264212613713198",
      "text": " What was your scar? And tell the crazy story on how you got it. These are my tiger stripes. I got them because I'm too alpha and literally grew out of my own skin.",
      "stats": {
        "commentCount": 8,
        "diggCount": 425,
        "playCount": 3453,
        "shareCount": 20,
        "engagementRate": 0.13119026933101652
      },
      "index": 53
    },
    {
      "id": "7174468846747651371",
      "text": " Here are the top 3 exercises I regret doing most. Number 1, chest press. This gave me some absolute honkers so now I have lower back pain from holding them up all day. Number 2, cable rows. Although these gave me big lats and I can pull a lot of weight, I still can't pull any woman. And finally, number 3, Bulgarian split squats. Yes, these doubled the size of my quads and the dumpy, but now my gym bros keep asking for a glute spread.",
      "stats": {
        "commentCount": 62,
        "diggCount": 42900,
        "playCount": 328500,
        "shareCount": 131,
        "engagementRate": 0.13118112633181125
      },
      "index": 54
    },
    {
      "id": "7187821222967905582",
      "text": " Typically when I'm doing a very hard set, I do like to cry mid-set as- Nah, JPG missed with this one. As you can see here, crying burns about 1.3 calories a minute. And those are calories you could be using to build muscle. I personally like to hold in my tears the entire set to maximize muscle gains.",
      "stats": {
        "commentCount": 12,
        "diggCount": 1428,
        "playCount": 11400,
        "shareCount": 51,
        "engagementRate": 0.13078947368421054
      },
      "index": 55
    },
    {
      "id": "7115408368444984619",
      "text": " Is it worth it to join the dark side and take gear? Well, it depends. Are you willing to inject a needle into your glute multiple times a week for the rest of your life? Some people think they can just run one testosterone cycle and then come off later. But when you're artificially pumping androgens into your body, your body naturally stops producing hormones like testosterone. So when you come off an 8, 12, 16 week cycle, you're going to have no natural testosterone. Not only does this mean you losing your game, but also having problems in everything that testosterone is used for. Sleep, recovery, energy, libido. I haven't even mentioned any side effects yet. Just remember to do your research before you make any decisions. It's a life commitment.",
      "stats": {
        "commentCount": 16,
        "diggCount": 524,
        "playCount": 4336,
        "shareCount": 27,
        "engagementRate": 0.13076568265682656
      },
      "index": 56
    },
    {
      "id": "7184850972445838635",
      "text": " i will never understand people that keep a straight face while lifting. i train until absolute failure. if i try to lift with no facial expressions, i will look straight constipated. i have no shame, catch me making the ugliest faces during my set.",
      "stats": {
        "commentCount": 57,
        "diggCount": 14600,
        "playCount": 112600,
        "shareCount": 47,
        "engagementRate": 0.1305861456483126
      },
      "index": 57
    },
    {
      "id": "7094342335911251242",
      "text": " Boys, is it worth it to bolt through summer?",
      "stats": {
        "commentCount": 34,
        "diggCount": 296,
        "playCount": 2729,
        "shareCount": 26,
        "engagementRate": 0.13045071454745327
      },
      "index": 58
    },
    {
      "id": "7062392217130028334",
      "text": " last class before I dry scoop pre and absolutely destroy my legs in the gym.",
      "stats": {
        "commentCount": 10,
        "diggCount": 377,
        "playCount": 3022,
        "shareCount": 7,
        "engagementRate": 0.13037723362011913
      },
      "index": 59
    },
    {
      "id": "7161129614650215723",
      "text": " DAAAAAAAMN! Nah, this could never work. If I see this, I'm taking the whole bowl and camping in the bushes for refills.",
      "stats": {
        "commentCount": 72,
        "diggCount": 25300,
        "playCount": 196600,
        "shareCount": 80,
        "engagementRate": 0.12946083418107834
      },
      "index": 60
    },
    {
      "id": "7170041603631942955",
      "text": "",
      "stats": {
        "commentCount": 30,
        "diggCount": 2690,
        "playCount": 21500,
        "shareCount": 45,
        "engagementRate": 0.12860465116279068
      },
      "index": 61
    },
    {
      "id": "7188556922499517738",
      "text": " Alright, if you're somewhat new to the gym and you're just getting in the realm of dieting and taking supplements, listen up. Never, and I mean ever, take your vitamins on an empty stomach. When I first started working on taking vitamins, I thought, oh, you know what, I'll just pop all the vitamins in the morning and I'll feel good, go for a run maybe. About an hour later, I started contemplating every decision I've ever made. It felt like my organs were playing the World Cup in my stomach. You know that type of nausea where you just gotta sit completely still and pray that nothing happens? It was like that, but worse. Don't make the same mistake I did, always eat something beforehand.",
      "stats": {
        "commentCount": 35,
        "diggCount": 2639,
        "playCount": 21300,
        "shareCount": 58,
        "engagementRate": 0.12826291079812208
      },
      "index": 62
    },
    {
      "id": "7178143879143820590",
      "text": " If you are bulking, eat whole eggs. For cutting, eat egg whites. If you're bulking, eat beef. For cutting, eat chicken. If you're bulking, eat bagels. For cutting, eat regular bread or rice cakes. If you're bulking, drink milk. But for cutting, drink unsweetened almond milk.",
      "stats": {
        "commentCount": 679,
        "diggCount": 225700,
        "playCount": 1800000,
        "shareCount": 2011,
        "engagementRate": 0.12688333333333332
      },
      "index": 63
    },
    {
      "id": "7083881497161141547",
      "text": " what person got you into lifted?",
      "stats": {
        "commentCount": 56,
        "diggCount": 493,
        "playCount": 4582,
        "shareCount": 23,
        "engagementRate": 0.12483631601920558
      },
      "index": 64
    },
    {
      "id": "7168553587512233262",
      "text": " Top 10 foods that will get you absolutely shredded. Number one, Greek yogurt. Two, ground turkey. Three, eggs. Four, low-fat cottage cheese. Five, powdered peanut butter. Six, shrimp. Seven, chicken. Eight, tuna. Nine, fish. Nine, ten, shrimp.",
      "stats": {
        "commentCount": 80,
        "diggCount": 9444,
        "playCount": 77300,
        "shareCount": 118,
        "engagementRate": 0.12473479948253557
      },
      "index": 65
    },
    {
      "id": "7187831382373109034",
      "text": " Here are the top five pre-workout snacks for an insane pump. Number one, Rice Krispie Treats. Number two, PB&J. Number three, bananas. Number four, honey. Number five, I already know somebody's gonna put it in the comments.",
      "stats": {
        "commentCount": 39,
        "diggCount": 3464,
        "playCount": 28500,
        "shareCount": 51,
        "engagementRate": 0.12470175438596491
      },
      "index": 66
    },
    {
      "id": "7110176284315225390",
      "text": " I can't tell if someone is on steroids. They have overly developed shoulders. He basically goes on to list other side effects of PED use such as balding and gyno. The problem is you can never tell if someone's on steroids just from these things alone. Male pattern baldness is a gene and I'm sure you've seen plenty of dudes out there that are completely bald that have never touched gear in their life. Same thing with gyno. I know a lot of people watching right now have some form of mild to severe gyno and they might not even be taking creatine. This kind of goes back to what I was saying in my previous video about steroid usage. If somebody's showing all of these things and they're also super jacked and shredded, then there might be reasonable suspicion.",
      "stats": {
        "commentCount": 19,
        "diggCount": 729,
        "playCount": 6198,
        "shareCount": 22,
        "engagementRate": 0.12423362374959665
      },
      "index": 67
    },
    {
      "id": "7144026601335016750",
      "text": " Dang, this dude's about to curl the 90s. I gotta see how good his form is. Alright, let's check this out.",
      "stats": {
        "commentCount": 2351,
        "diggCount": 754300,
        "playCount": 6200000,
        "shareCount": 8660,
        "engagementRate": 0.12343725806451612
      },
      "index": 68
    },
    {
      "id": "7185588802084179242",
      "text": " Nah, this dude is being way too generous. The bar legit moved less than an inch. Here's a before, here's the after. Powerlifting rules need to change, man, or else Larry Wheels is gonna bench 10,000 pounds.",
      "stats": {
        "commentCount": 21,
        "diggCount": 4439,
        "playCount": 36700,
        "shareCount": 47,
        "engagementRate": 0.12280653950953678
      },
      "index": 69
    },
    {
      "id": "7167087887484357934",
      "text": " Oh no, why would you do that? Spotting etiquette 101 because a lot of you need to see this. I do not care how bad it looks like I am struggling. If the bar does not lower at all while I am pushing it, it doesn't matter if it's stationary for like 10 seconds, then you do not touch the bar. You can hover your hands just in case the person drops the weight, but do not touch the bar. Do this to somebody who needs it.",
      "stats": {
        "commentCount": 97,
        "diggCount": 17700,
        "playCount": 147400,
        "shareCount": 258,
        "engagementRate": 0.1224898236092266
      },
      "index": 70
    },
    {
      "id": "7067300902398594350",
      "text": "",
      "stats": {
        "commentCount": 350,
        "diggCount": 541,
        "playCount": 7380,
        "shareCount": 9,
        "engagementRate": 0.12195121951219512
      },
      "index": 71
    },
    {
      "id": "7124721346676051246",
      "text": " Combine that exercise with leg extensions and Bulgarian split squats and you will literally have massive quads.",
      "stats": {
        "commentCount": 278,
        "diggCount": 62700,
        "playCount": 519900,
        "shareCount": 366,
        "engagementRate": 0.12183881515676091
      },
      "index": 72
    },
    {
      "id": "7180018204092402990",
      "text": " Everybody always talks about the good things that come from the gym like getting confidence and strength. But today I'm going to be going over some of the side effects. Number one, I physically have to take all the groceries in one trip. I don't care how many there are, I will find a way to avoid a second trip. Number two, the amount of laundry I have from going to the gym every day is insane. I never thought that I would have to do this much laundry, it's getting out of hand. Finally, number three, my headphones are always dead. The worst is when they die while you're working out and then you have to listen to the gym music. I don't wish that pain upon anyone.",
      "stats": {
        "commentCount": 24,
        "diggCount": 3452,
        "playCount": 29000,
        "shareCount": 50,
        "engagementRate": 0.12158620689655172
      },
      "index": 73
    },
    {
      "id": "7184473613763120430",
      "text": " Alright New Year's lifters listen up here's the best advice for starting out in the gym. Number one make sure you only workout at Planet Fitness. This is by far the best gym only absolute alphas workout here. Number two wear lifting gloves on every single exercise even when going to the bathroom. You don't want to risk hurting your hands. And finally number three do not touch the bench press or any other free weights they're far too dangerous. Just use the treadmills instead.",
      "stats": {
        "commentCount": 126,
        "diggCount": 7675,
        "playCount": 65200,
        "shareCount": 103,
        "engagementRate": 0.12122699386503068
      },
      "index": 74
    },
    {
      "id": "7163746685590539562",
      "text": " When people talk about bad chest genetics, they're really talking about insertions. Some people like Tristan Lee have a large gap in the middle of their chest insertions. It makes the overall muscle body appear a lot smaller. Other people without this gap in the middle have the appearance of a much fuller chest. When you look at this guy's chest transformation, he has good insertions to begin with. And he did not change his genetics because that same gap that's right there in the middle is still there in the end transformation. He just built a lot more muscle around it, making it less noticeable.",
      "stats": {
        "commentCount": 133,
        "diggCount": 144600,
        "playCount": 1200000,
        "shareCount": 180,
        "engagementRate": 0.12076083333333333
      },
      "index": 75
    },
    {
      "id": "7083616927641292078",
      "text": " gem bathrooms be like.",
      "stats": {
        "commentCount": 174,
        "diggCount": 25900,
        "playCount": 227600,
        "shareCount": 954,
        "engagementRate": 0.11875219683655536
      },
      "index": 76
    },
    {
      "id": "7161861793000803626",
      "text": " This random guy wanted to join me. I love the hot space, it's spinning my face for love. I feel crazy, spinning my face for love. I feel crazy, spinning my face for love. Friendship man. Yo, I don't know who this guy is. He kind of looks new to the gym. But this is not a very optimal range of motion. You actually want to be bringing the dumbbell up just a little bit more. You should definitely follow my page for more tips.",
      "stats": {
        "commentCount": 25,
        "diggCount": 3867,
        "playCount": 33100,
        "shareCount": 30,
        "engagementRate": 0.1184894259818731
      },
      "index": 77
    },
    {
      "id": "7167463140026797355",
      "text": " Here are the top 3 things that will make you look like an alpha at the gym. Number 1, not reracking your weights. This is an absolute power move and will show everybody else at the gym how dedicated you are to getting gains. Number 2, screaming as loud as possible during your set. This will alert everyone around you on how much you can lift and they will respect you so much more. And finally, number 3, not wiping down your equipment. People love to see exactly how hard you're working and you'll probably get tons of compliments for this. Be sure to share this with your friends.",
      "stats": {
        "commentCount": 33,
        "diggCount": 2395,
        "playCount": 20900,
        "shareCount": 46,
        "engagementRate": 0.1183732057416268
      },
      "index": 78
    },
    {
      "id": "7188934024386170155",
      "text": " Here are the top three low calorie, high protein, fast food options. Number one, we got the Chick-fil-A Cool Wrap. Without the sauce, this thing is 43 grams of protein and only 350 calories. Number two, Wendy's Asiago Ranch Club. For only 490 calories, this thing packs 40 grams of protein. And finally, number three, my favorite, the Chicken Power Bowl from Taco Bell. 27 grams of protein, under 500 calories, and you can easily add extra chicken for over 40 grams of protein.",
      "stats": {
        "commentCount": 25,
        "diggCount": 2188,
        "playCount": 19200,
        "shareCount": 54,
        "engagementRate": 0.11807291666666667
      },
      "index": 79
    },
    {
      "id": "7067289313658277166",
      "text": " To a god",
      "stats": {
        "commentCount": 185,
        "diggCount": 1585,
        "playCount": 15400,
        "shareCount": 34,
        "engagementRate": 0.11714285714285715
      },
      "index": 80
    },
    {
      "id": "7066577412884286766",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 17,
        "diggCount": 1349,
        "playCount": 11900,
        "shareCount": 21,
        "engagementRate": 0.11655462184873949
      },
      "index": 81
    },
    {
      "id": "7115052576734727467",
      "text": " Yeah, yeah, yeah, yeah, yeah",
      "stats": {
        "commentCount": 23,
        "diggCount": 499,
        "playCount": 4663,
        "shareCount": 21,
        "engagementRate": 0.11644863821574095
      },
      "index": 82
    },
    {
      "id": "7152190392450960686",
      "text": " with great power. Leg extensions, hack squat, leg press. Be in control to recessive 6-10 reps.",
      "stats": {
        "commentCount": 243,
        "diggCount": 50900,
        "playCount": 441900,
        "shareCount": 162,
        "engagementRate": 0.11610092781172211
      },
      "index": 83
    },
    {
      "id": "7115883275331112238",
      "text": " Do you want to get rid of unwanted love handles? Well what you don't want to do is train abs and do a bunch of cardio. Because there's no such thing as spot reduction and you can do all the cardio in the world if you're not changing your diet it's not going to matter. You want to be in a caloric deficit. It essentially means you're burning more calories than you're eating. Recommend staying in a 200 to 400 calorie deficit.",
      "stats": {
        "commentCount": 20,
        "diggCount": 857,
        "playCount": 7797,
        "shareCount": 28,
        "engagementRate": 0.11607028344234963
      },
      "index": 84
    },
    {
      "id": "7179253366386658602",
      "text": " Is it just me or is buying protein getting way too expensive? I swear these Greek yogurt used to be $3. But every time I go to the grocery store they keep adding another 10 or 20 cents on. Now they're like over $5 with tax! Don't get me started on the meat section. My wallet starts to hurt just by walking near this aisle. I'm going to have to take out a loan just to hit 100 grams of protein every day. Y'all are going to catch me rocking the dino nuggies this bulk I can't do this anymore.",
      "stats": {
        "commentCount": 87,
        "diggCount": 4976,
        "playCount": 44100,
        "shareCount": 49,
        "engagementRate": 0.11591836734693878
      },
      "index": 85
    },
    {
      "id": "7155120934888787242",
      "text": " I'm gonna leave you alone Nah man, the pump gown only works if you're like 300 pounds of pure muscle. If I show up to the gym and pull this queen-sized bedsheet off my body, only to reveal this underneath I'm getting roasted.",
      "stats": {
        "commentCount": 205,
        "diggCount": 126700,
        "playCount": 1100000,
        "shareCount": 191,
        "engagementRate": 0.11554181818181818
      },
      "index": 86
    },
    {
      "id": "7177065521911696686",
      "text": " you got a situation stop sweating darlin' yeah just cool don't if you are not doing some variation of cable curls when training biceps i would highly recommend that you start this is because there's virtually no tension on the biceps during the top and bottom portions of the movement however when doing a cable curl that tension remains on the bicep throughout the entire range of motion i personally love rope hammer curls because of that constant tension these blew my biceps up like crazy",
      "stats": {
        "commentCount": 84,
        "diggCount": 16800,
        "playCount": 147400,
        "shareCount": 136,
        "engagementRate": 0.11546811397557666
      },
      "index": 87
    },
    {
      "id": "7161436315895156014",
      "text": " And she can't get enough, I don't wanna fall in love Best 3 back exercises are lap pull downs, cable rows, and any variation of chest supported row. This is a hold 3 sets of 6-10 reps.",
      "stats": {
        "commentCount": 58,
        "diggCount": 5076,
        "playCount": 44900,
        "shareCount": 48,
        "engagementRate": 0.11541202672605791
      },
      "index": 88
    },
    {
      "id": "7179249949388016942",
      "text": " Here are the top 3 things I wish I knew before I started lifting. Number 1, adding more volume to a weak muscle group. When I first started lifting, my biceps would not grow as much as my other muscle groups, even though I was training them twice a week like everything else. This was not only because they were a genetic weak point for me, but I was also just throwing them in at the end of my back days. Once I started doing a dedicated arm day for training biceps, I instantly started to see improvements. Number 2, stopping sets when they became uncomfortable or started to hurt. If you want to see serious long term growth, you are going to have to push yourself past the point of it hurting. Number 3, doing a non-optimal exercise just because I could feel the muscle. Just because you can feel a muscle while doing a movement doesn't mean it's a great exercise. If you want to know the best exercises to do for each muscle group, I have plenty of videos on my page.",
      "stats": {
        "commentCount": 18,
        "diggCount": 4499,
        "playCount": 39600,
        "shareCount": 42,
        "engagementRate": 0.11512626262626263
      },
      "index": 89
    },
    {
      "id": "7175932342182300974",
      "text": " Here are the top 3 reasons I regret doing push pull legs. Number 1, it made my chest and back overly massive so now I rip every tank top I try to take off. Number 2, it made my arms big and vascular so now dudes keep coming up to me at the gym and asking me for something called tren. And finally, it gave me juicy quads and an absolute dumpy, but now my gym bros keep asking to spot me on every exercise.",
      "stats": {
        "commentCount": 116,
        "diggCount": 13900,
        "playCount": 122600,
        "shareCount": 70,
        "engagementRate": 0.11489396411092985
      },
      "index": 90
    },
    {
      "id": "7184104307174886702",
      "text": " Everybody cares how big your biceps are or your triceps because they're not the most important muscle. Preacher curl for short head, incline curl for long head, hammer curls for brachialis, pull crushers for lateral head, push downs for long head, and cross body cable extension for all three heads. Heavy and controlled through sets of 8-12 reps.",
      "stats": {
        "commentCount": 1108,
        "diggCount": 638200,
        "playCount": 5600000,
        "shareCount": 3953,
        "engagementRate": 0.11486803571428572
      },
      "index": 91
    },
    {
      "id": "7162566195760205099",
      "text": " Here are the top five mistakes I made as a beginner in the gym. Number one, not resting two to three minutes in between sets. Number two, not eating 0.7 to 1 gram of protein per pound of body weight. Number three, not getting seven to eight hours of sleep every night. Number four, not training two or near failure. And number five, not drinking at least half a gallon of water a day.",
      "stats": {
        "commentCount": 85,
        "diggCount": 5824,
        "playCount": 52100,
        "shareCount": 58,
        "engagementRate": 0.11452975047984645
      },
      "index": 92
    },
    {
      "id": "7182995349898956078",
      "text": " girthy pop-eye forearms is the best way to show that you actually go to the gym. Reverse curls for the top, wrist curls for the bottom, and hammer curls for the sides of the forearms. Heavy and controlled recess of 8 to 12 reps.",
      "stats": {
        "commentCount": 225,
        "diggCount": 136700,
        "playCount": 1200000,
        "shareCount": 390,
        "engagementRate": 0.11442916666666667
      },
      "index": 93
    },
    {
      "id": "7106190963340774702",
      "text": " I need you, I need you",
      "stats": {
        "commentCount": 8,
        "diggCount": 679,
        "playCount": 6192,
        "shareCount": 21,
        "engagementRate": 0.11434108527131782
      },
      "index": 94
    },
    {
      "id": "7125519968543739182",
      "text": " Has anyone else just been skipping legs all summer because they don't care? I've skipped legs for the last- Here are three reasons why you shouldn't skip legs. The first reason and probably the most important is training legs increases testosterone. Yes, you heard that right. Ironically, by training your legs you are helping your upper body gain muscle. Second reason you shouldn't skip legs is because you don't want to be that dude on the beach wearing joggers when it's like 90 degrees outside. Last reason you should be training legs is because they look sick. I mean, come on, come on, you don't have big claws, come on.",
      "stats": {
        "commentCount": 31,
        "diggCount": 1038,
        "playCount": 9591,
        "shareCount": 27,
        "engagementRate": 0.11427379835262225
      },
      "index": 95
    },
    {
      "id": "7153341800957398318",
      "text": " If your favorite day in the gym is back day, you are a psychopath. Lap pull down, cable row, seated machine row, incline curl, cable hammer curl, machine preacher curl. And control 3 sets of 6-10 reps.",
      "stats": {
        "commentCount": 653,
        "diggCount": 192400,
        "playCount": 1700000,
        "shareCount": 962,
        "engagementRate": 0.11412647058823529
      },
      "index": 96
    },
    {
      "id": "7169620645502930222",
      "text": " do not dirty bulk this winter you will regret it unless you're somebody that really struggles to put on weight dirty bulking is absolutely pointless say you engorge yourself with food and you gain 30 pounds as bulk unless you're taking peds over 25 pounds of that is just gonna be fat that you'll then have to cut out later now i'm not saying you have to be really strict and eat super clean just don't eat thousands of calories in excess there's really no point",
      "stats": {
        "commentCount": 58,
        "diggCount": 4496,
        "playCount": 40300,
        "shareCount": 44,
        "engagementRate": 0.11409429280397022
      },
      "index": 97
    },
    {
      "id": "7068731628717133102",
      "text": " Foods that are guaranteed to get you jacked.",
      "stats": {
        "commentCount": 11,
        "diggCount": 283,
        "playCount": 2714,
        "shareCount": 15,
        "engagementRate": 0.11385408990420044
      },
      "index": 98
    },
    {
      "id": "7185953264767175979",
      "text": " Alright Joey Swole, don't come after me. But this dude is speedrunning to gym membership termination. There are probably people literally terrified to use these machines here. Love to see people training hard but maybe save this one for home.",
      "stats": {
        "commentCount": 22,
        "diggCount": 3200,
        "playCount": 28900,
        "shareCount": 57,
        "engagementRate": 0.11346020761245675
      },
      "index": 99
    },
    {
      "id": "7069859263362895150",
      "text": " The most overrated exercise in my opinion P2.",
      "stats": {
        "commentCount": 13,
        "diggCount": 439,
        "playCount": 4093,
        "shareCount": 12,
        "engagementRate": 0.11336428047886636
      },
      "index": 100
    },
    {
      "id": "7163311753021885739",
      "text": " Here are the top 10 foods you should be eating to gain muscle. Number one, shrimp, two, peanut butter, three, Greek yogurt, four, fish, five, cottage cheese, six, beef, seven, tuna, eight, chicken, nine, eggs, and 10, whey protein.",
      "stats": {
        "commentCount": 103,
        "diggCount": 7456,
        "playCount": 67600,
        "shareCount": 97,
        "engagementRate": 0.11325443786982249
      },
      "index": 101
    },
    {
      "id": "7078818843543604523",
      "text": " If you could make one muscle instantly bigger, what would it be?",
      "stats": {
        "commentCount": 350,
        "diggCount": 1199,
        "playCount": 13900,
        "shareCount": 21,
        "engagementRate": 0.11294964028776978
      },
      "index": 102
    },
    {
      "id": "7117341226751266090",
      "text": " a You can bench 225 pounds that is extremely impressive Estimates show that only between one and three percent of gym goers in the US can actually bench 225 pounds the reason why it seems so common on tik-tok is because you're seeing the best of the best when in reality if you were to go walk out in public be pretty rare to find a normal person that benches 225 Everyone goes at their own pace try not to compare yourself to others",
      "stats": {
        "commentCount": 29,
        "diggCount": 1022,
        "playCount": 9564,
        "shareCount": 24,
        "engagementRate": 0.11240066917607695
      },
      "index": 103
    },
    {
      "id": "7085470777415339307",
      "text": " I think I remember those eyes, eyes, eyes, eyes, eyes I heard it tonight Did you just want me to love you?",
      "stats": {
        "commentCount": 15,
        "diggCount": 273,
        "playCount": 2717,
        "shareCount": 17,
        "engagementRate": 0.11225616488774383
      },
      "index": 104
    },
    {
      "id": "7085473256593034542",
      "text": " I don't know why",
      "stats": {
        "commentCount": 23,
        "diggCount": 522,
        "playCount": 5092,
        "shareCount": 25,
        "engagementRate": 0.11194029850746269
      },
      "index": 105
    },
    {
      "id": "7175936873569783083",
      "text": " best guide you'll ever see on how to build a wider back. Lap pulldown for upper back, cable rows for mid to lower back, and seated machine row for mid back. Heavy and controlled, 3 sets of 6-10 reps.",
      "stats": {
        "commentCount": 66,
        "diggCount": 7552,
        "playCount": 68800,
        "shareCount": 66,
        "engagementRate": 0.1116860465116279
      },
      "index": 106
    },
    {
      "id": "7185224084987399466",
      "text": " Your muscles build an amazing body is to lift with light weights not heavy weight I completely agree all these dudes you see here. They probably use really light weights never touch heavy weight Chris Bumstead Don't know if you know and he's kind of like this small dude that works out He probably uses like 15 the lateral raises for like 30 reps all jokes aside You need to be lifting as heavy as possible within your rep range to see long-term muscle growth reason why I primarily promote the age of 12 rep ranges because this is typically the easiest for people to gauge true failure on an Exercise a lot of the time when people hit those higher rep ranges They tend to sell themselves short and will stop when it kind of starts to burn even though they have many more reps in The tank at the end of the day will make a tremendous difference of whatever rep range you choose to use as long as you're trained to or near failure",
      "stats": {
        "commentCount": 77,
        "diggCount": 5132,
        "playCount": 47300,
        "shareCount": 39,
        "engagementRate": 0.11095137420718816
      },
      "index": 107
    },
    {
      "id": "7061753141162904879",
      "text": " to hell",
      "stats": {
        "commentCount": 4,
        "diggCount": 153,
        "playCount": 1573,
        "shareCount": 16,
        "engagementRate": 0.10998092816274635
      },
      "index": 108
    },
    {
      "id": "7068731970506984750",
      "text": " If you're not doing this exercise, you're killing your gains. My Today My credentials",
      "stats": {
        "commentCount": 15,
        "diggCount": 361,
        "playCount": 3574,
        "shareCount": 17,
        "engagementRate": 0.10996082820369334
      },
      "index": 109
    },
    {
      "id": "7171103293500886314",
      "text": " If you are bulking right now and not worried about eating super clean, run to your mom and ask her to buy you this. Tyson Air Fried Chicken Nuggets 75% less fat. Hear me out, for 10 nuggets, it's 30 grams of protein and only 320 calories. These taste amazing and it's been making it so much easier for me to get my protein in.",
      "stats": {
        "commentCount": 44,
        "diggCount": 3849,
        "playCount": 36400,
        "shareCount": 90,
        "engagementRate": 0.10942307692307693
      },
      "index": 110
    },
    {
      "id": "7161425184241667374",
      "text": " What have you been training for? Four years. Four years. Are you guys natural? Yes. What have you been training for?",
      "stats": {
        "commentCount": 36,
        "diggCount": 5353,
        "playCount": 49900,
        "shareCount": 57,
        "engagementRate": 0.1091382765531062
      },
      "index": 111
    },
    {
      "id": "7187068574429891886",
      "text": " Okay, does anybody know how often you're actually supposed to wash your gym water bottle? Because like, if you only fill it with water, then how can it ever get dirty? Okay, I looked it up, you're supposed to apparently clean it every day. I think I might die, I'm lucky if I even get to it once a week.",
      "stats": {
        "commentCount": 59,
        "diggCount": 3121,
        "playCount": 29800,
        "shareCount": 57,
        "engagementRate": 0.1086241610738255
      },
      "index": 112
    },
    {
      "id": "7146965594611404075",
      "text": " come to me and say dude what is the shoulder workout? Dumbbell overhead press for front delt, lateral raises for side delts, and reverse cable flys for rear delts. Heavy and controlled three sets of 8 to 12 reps.",
      "stats": {
        "commentCount": 438,
        "diggCount": 300300,
        "playCount": 2800000,
        "shareCount": 1107,
        "engagementRate": 0.10780178571428571
      },
      "index": 113
    },
    {
      "id": "7188927111896354090",
      "text": " look at this he has a 25 pound dumbbell in his mouth okay forget about whatever this dude is doing but what gym is this? i honestly thought it was an arcade at first this place looks like they hand you a laser type gun when you walk in it seems like a cool place to train but i feel like i would get sick of the colors after a while",
      "stats": {
        "commentCount": 16,
        "diggCount": 1082,
        "playCount": 10500,
        "shareCount": 33,
        "engagementRate": 0.10771428571428572
      },
      "index": 114
    },
    {
      "id": "7157692691168431406",
      "text": " Muscle group tier list, let's go. First up, you know we gotta put chest in S tier. Pinnacle of aesthetics, extremely fun to train, I mean come on. I'm also gonna have to throw abs in S tier. Think about all the kings of aesthetics. Jeff Sy, David Lay, they all have the chest and the abs. Next up, I'm gonna have to throw forearms in B tier. These are like a side character. Nobody's looking at Seabum's forearms when he's on stage. Biceps gonna have to be A tier. Just solid overall to have. Now back's gonna be in S tier. Demon back is crucial for V taper and overall aesthetics. Shoulders are gonna be a very solid A. Some nice delts could really take your physique to the next level. What we got next? Legs, triceps are also gonna have to be an A for me. They make your arm look way bigger and you can flex them every single time you walk past a mirror.",
      "stats": {
        "commentCount": 77,
        "diggCount": 7531,
        "playCount": 71200,
        "shareCount": 59,
        "engagementRate": 0.10768258426966291
      },
      "index": 115
    },
    {
      "id": "7176293357914885422",
      "text": " oh my god, the meat writing is crazy i'm sorry, but why even wear a stringer at this point? my man put dental floss over his nipples and called it a day there is more fabric on a thong than what he's wearing",
      "stats": {
        "commentCount": 25,
        "diggCount": 5234,
        "playCount": 49400,
        "shareCount": 49,
        "engagementRate": 0.1074493927125506
      },
      "index": 116
    },
    {
      "id": "7154405397695139118",
      "text": " If you want to get stronger in the gym, you must work these accessory muscles, strengthening the muscles of the anal cavity. I don't have any exercises for this one.",
      "stats": {
        "commentCount": 48,
        "diggCount": 3728,
        "playCount": 35600,
        "shareCount": 40,
        "engagementRate": 0.10719101123595505
      },
      "index": 117
    },
    {
      "id": "7102533854296067371",
      "text": " You know when you're built for aesthetic, not for strength.",
      "stats": {
        "commentCount": 11,
        "diggCount": 435,
        "playCount": 4372,
        "shareCount": 22,
        "engagementRate": 0.1070448307410796
      },
      "index": 118
    },
    {
      "id": "7151044080666135854",
      "text": " So people have been asking me how I actually blow up my arms. Now before you skip this- Ankline curl. Hammer curl. Machine preacher curl. And control at recess of 8-12 reps.",
      "stats": {
        "commentCount": 845,
        "diggCount": 318000,
        "playCount": 3000000,
        "shareCount": 1571,
        "engagementRate": 0.10680533333333334
      },
      "index": 119
    },
    {
      "id": "7157028912675999018",
      "text": " wait for a date so we are living only if you're not a construction worker because if you are, the jeans will add plus 200% strength these are the strongest dudes I've ever encountered",
      "stats": {
        "commentCount": 20,
        "diggCount": 6877,
        "playCount": 65100,
        "shareCount": 27,
        "engagementRate": 0.1063594470046083
      },
      "index": 120
    },
    {
      "id": "7095435384573889838",
      "text": " No amount of soreness will compare to when you first used this machine.",
      "stats": {
        "commentCount": 634,
        "diggCount": 32500,
        "playCount": 320800,
        "shareCount": 942,
        "engagementRate": 0.1062219451371571
      },
      "index": 121
    },
    {
      "id": "7180751287565208874",
      "text": " One kiss is all it takes. Falling in love with me. If you suffer from gyno, there is still hope for you. Gynecomastia is the development of breast tissue in males usually due to hormone imbalances. Unfortunately, once the tissue has developed, it is very unlikely that it will completely go away without surgery. However, reducing your overall body fat percentage can make it look a lot better. This is because you are reducing a lot of the fat tissue in that surrounding area making the gyno a lot less noticeable in appearance.",
      "stats": {
        "commentCount": 29,
        "diggCount": 7370,
        "playCount": 70700,
        "shareCount": 75,
        "engagementRate": 0.10571428571428572
      },
      "index": 122
    },
    {
      "id": "7170766610368564526",
      "text": " He goes on to deadlift and squat the same 500 pounds right after. And yes, he hits depth. What is this dude training for, to fight Thanos? He just played with all of our dream PRs and it didn't phase him.",
      "stats": {
        "commentCount": 7,
        "diggCount": 2371,
        "playCount": 22900,
        "shareCount": 37,
        "engagementRate": 0.1054585152838428
      },
      "index": 123
    },
    {
      "id": "7140272990239116590",
      "text": " So I thought it was pretty much common knowledge at this point that Liver King was not natural until I read the comments of this video. There's an old saying that goes you can either be big, shredded, or natural, but you can only have two of those three things. It's not that he's overly massive because I actually looked up his height and he's not that tall. It's the fact that he is shredded to the gills, has deep ab cuts, and any type of lighting 24-7 while retaining that same amount of muscle mass. Let me also remind you, this guy is 45 years old. Given all that information, you make your best judgment.",
      "stats": {
        "commentCount": 99,
        "diggCount": 25600,
        "playCount": 244700,
        "shareCount": 37,
        "engagementRate": 0.1051736820596649
      },
      "index": 124
    },
    {
      "id": "7108109159819726123",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 34,
        "diggCount": 295,
        "playCount": 3328,
        "shareCount": 21,
        "engagementRate": 0.10516826923076923
      },
      "index": 125
    },
    {
      "id": "7177446114088521003",
      "text": " Here are the top 3 reasons I regret taking creatine. Number 1, it made me stronger in the gym, but the worst part of being stronger is that the weights keep getting heavier. I'll be in the gym like, damn, why is this weight so heavy? But I gotta do it because I wanna grow. Number 2, it gave me way more endurance, so now I spend like 3 hours in the gym hiding away from my real world problems. And number 3, it made my muscles full and juicy, so now my gym bros jump me when I walk into the locker room.",
      "stats": {
        "commentCount": 223,
        "diggCount": 55500,
        "playCount": 534400,
        "shareCount": 323,
        "engagementRate": 0.10487649700598803
      },
      "index": 126
    },
    {
      "id": "7185950163372887338",
      "text": " I'll run you on some fast food options so you can stay on track when you're on the going in a pinch Rax, you forgot the chicken parable from Taco Bell this thing is way cheaper than Chipotle, less than 500 calories and 27 grams of protein and you can add extra chicken to easily make it close to 40 grams of protein my absolute go-to tastes delicious",
      "stats": {
        "commentCount": 24,
        "diggCount": 4351,
        "playCount": 42700,
        "shareCount": 96,
        "engagementRate": 0.10470725995316159
      },
      "index": 127
    },
    {
      "id": "7083620991695473966",
      "text": " Don't cut just because summer's coming up. If you aren't big enough, you'll just look skinny.",
      "stats": {
        "commentCount": 19,
        "diggCount": 324,
        "playCount": 3495,
        "shareCount": 22,
        "engagementRate": 0.1044349070100143
      },
      "index": 128
    },
    {
      "id": "7121723614361095470",
      "text": " Here are three things you might be doing wrong on bench press. The first thing and probably the most common I always see is people bending their wrists backwards when holding the barbell. If you're experiencing wrist pain on bench press, it is probably most likely due to this. Not only will keeping your hands upright fix that wrist pain, it'll also give you more power and strength on bench. Next mistake you might be making is loading up too much weight on the bar and bouncing it off your chest. It's okay to use a little bit of momentum on that bottom portion of the rep, but if you're literally bouncing the bar off of your rib cage, not only are you asking for an injury, you're also not helping your muscle gains at all. Last mistake I always see is people either having the bar coming down too low or too high on their chest. You want to lower the bar just to right about where your pec ends. This is the natural bar path for this movement and will help you add on strength to your bench.",
      "stats": {
        "commentCount": 52,
        "diggCount": 10600,
        "playCount": 102800,
        "shareCount": 82,
        "engagementRate": 0.10441634241245136
      },
      "index": 129
    },
    {
      "id": "7174112666389171498",
      "text": " If you are looking to grow some massive forearms, I would highly recommend doing rope hammer curls. Coming from somebody who never trains forearms, I recently started doing these to add variation to my bicep training. But they accidentally kickstarted new beginnings to my forearms. The constant tension literally feels amazing. Go ahead and give these a try.",
      "stats": {
        "commentCount": 42,
        "diggCount": 7639,
        "playCount": 74400,
        "shareCount": 79,
        "engagementRate": 0.1043010752688172
      },
      "index": 130
    },
    {
      "id": "7162911055117602090",
      "text": " i'm getting nice, i'm skating i'm gonna be honest, i didn't even read what that said. belaying bare skin on the gym bathroom floor is crazy.",
      "stats": {
        "commentCount": 18,
        "diggCount": 2685,
        "playCount": 26300,
        "shareCount": 24,
        "engagementRate": 0.10368821292775665
      },
      "index": 131
    },
    {
      "id": "7125868537650007342",
      "text": " is also people who can't seem to get a pump. If you want insane pumps at the gym, you need to be making sure that you're eating some sort of fast digesting carb right before your workout. This can be a Rice Krispie treat, banana, PB and J, anything like that. On top of that, you wanna be extremely hydrated and take some form of L-citrulline or glycerol. These are found in most pre-workouts and will help draw all that blood and water into your muscles.",
      "stats": {
        "commentCount": 9,
        "diggCount": 924,
        "playCount": 9294,
        "shareCount": 27,
        "engagementRate": 0.10329244673983215
      },
      "index": 132
    },
    {
      "id": "7088756887206022446",
      "text": " signs you're making games",
      "stats": {
        "commentCount": 71,
        "diggCount": 2002,
        "playCount": 20600,
        "shareCount": 48,
        "engagementRate": 0.10296116504854369
      },
      "index": 133
    },
    {
      "id": "7083881870072679726",
      "text": " Now I'll be in the jet for more than two hours.",
      "stats": {
        "commentCount": 31,
        "diggCount": 448,
        "playCount": 4873,
        "shareCount": 21,
        "engagementRate": 0.10260619741432382
      },
      "index": 134
    },
    {
      "id": "7113909370240421162",
      "text": " So it's pretty much common knowledge at this point that decline bench is not optimal for growing your chest. This is because a majority of lifters already have an overdeveloped lower chest, but they neglect the upper chest, giving you that fullness. Yet I still see people performing their cable flyes like this in a downwards pattern. Having the machine set to that height is practically doing a decline bench press, just in a fly version. If you really want a big chest and want to get that fullness, you need to lower them setting on the machine and get this incline variation.",
      "stats": {
        "commentCount": 26,
        "diggCount": 690,
        "playCount": 7229,
        "shareCount": 25,
        "engagementRate": 0.10250380412228524
      },
      "index": 135
    },
    {
      "id": "7159262332521024810",
      "text": " If you are not training exactly like this every single set you will literally not grow muscle.",
      "stats": {
        "commentCount": 570,
        "diggCount": 120600,
        "playCount": 1200000,
        "shareCount": 1784,
        "engagementRate": 0.10246166666666667
      },
      "index": 136
    },
    {
      "id": "7169605143514762542",
      "text": " Why is nobody talking about Conor McGregor's recent transformation? This is what he looked like before, you know, relatively muscular, decent size. But this is what he looks like now, absolutely housed. Look at this dude's quads! It's like he put on 20 pounds of muscle since that last photo. Considering he's probably not being tested right now, do you guys think this is natural?",
      "stats": {
        "commentCount": 61,
        "diggCount": 3613,
        "playCount": 36200,
        "shareCount": 34,
        "engagementRate": 0.10243093922651934
      },
      "index": 137
    },
    {
      "id": "7089130032680963371",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 47,
        "diggCount": 1094,
        "playCount": 11600,
        "shareCount": 47,
        "engagementRate": 0.10241379310344828
      },
      "index": 138
    },
    {
      "id": "7099528355262827818",
      "text": "",
      "stats": {
        "commentCount": 8,
        "diggCount": 284,
        "playCount": 3070,
        "shareCount": 22,
        "engagementRate": 0.1022801302931596
      },
      "index": 139
    },
    {
      "id": "7168849421596101931",
      "text": " Here are the top 5 things you need to be doing in order to have a perfect bulk. Number 1, you need to be eating 200 to 400 calories above your maintenance. A caloric surplus puts your body in the best possible state to be building muscle. Number 2, you need to be eating at least 0.7 to 1 gram of protein per pound of body weight. Number 3, you need to be getting at least 7 to 8 hours of sleep every single night to allow your muscles to recover. Number 4, you should be applying progressive overload to every workout. This can be upping the weight, slowing down the reps, doing pause reps, just make sure you're increasing intensity. And finally, number 5, tread.",
      "stats": {
        "commentCount": 27,
        "diggCount": 2189,
        "playCount": 22100,
        "shareCount": 43,
        "engagementRate": 0.10221719457013574
      },
      "index": 140
    },
    {
      "id": "7098042599201606954",
      "text": "",
      "stats": {
        "commentCount": 21,
        "diggCount": 1379,
        "playCount": 14100,
        "shareCount": 32,
        "engagementRate": 0.10156028368794326
      },
      "index": 141
    },
    {
      "id": "7123184348291009835",
      "text": " Combine that exercise with rope tricep extensions and some form of skull crushers and you will literally have massive triceps.",
      "stats": {
        "commentCount": 116,
        "diggCount": 37400,
        "playCount": 373600,
        "shareCount": 234,
        "engagementRate": 0.10104389721627409
      },
      "index": 142
    },
    {
      "id": "7104754124654251307",
      "text": " Even if it meant killing her. Whatever it takes!",
      "stats": {
        "commentCount": 16,
        "diggCount": 1201,
        "playCount": 12300,
        "shareCount": 25,
        "engagementRate": 0.10097560975609757
      },
      "index": 143
    },
    {
      "id": "7090231355946077482",
      "text": " But I don't fucking care I don't fucking care I don't fucking care",
      "stats": {
        "commentCount": 14,
        "diggCount": 557,
        "playCount": 5901,
        "shareCount": 24,
        "engagementRate": 0.10083036773428232
      },
      "index": 144
    },
    {
      "id": "7165226535753141550",
      "text": " It's simple really. I'm just better than you.",
      "stats": {
        "commentCount": 27,
        "diggCount": 1684,
        "playCount": 17400,
        "shareCount": 35,
        "engagementRate": 0.1003448275862069
      },
      "index": 145
    },
    {
      "id": "7167448578141523243",
      "text": " People always ask me, Nick, what is the secret to getting a big back? How do you put a V-Taper like that? The key is doing heavy rows. You can do a barbell row, a seated machine row, these are my favorite. But the secret is you don't just want to be going through the motions. You want to practice mind-muscle connection by keeping your elbows tucked and driving them back towards your waist. This is the biggest factor that helped me grow my lats.",
      "stats": {
        "commentCount": 31,
        "diggCount": 2461,
        "playCount": 25200,
        "shareCount": 36,
        "engagementRate": 0.10031746031746032
      },
      "index": 146
    },
    {
      "id": "7126217401410063662",
      "text": " hit all of them you have to use your forearms as a stabilizer. Combine that exercise with wrist curls and some form of reverse curl and you will literally have some massive forearms.",
      "stats": {
        "commentCount": 24,
        "diggCount": 6965,
        "playCount": 70400,
        "shareCount": 65,
        "engagementRate": 0.10019886363636364
      },
      "index": 147
    },
    {
      "id": "7063552039749537071",
      "text": " He got in my shot so I had to mock him.",
      "stats": {
        "commentCount": 15,
        "diggCount": 546,
        "playCount": 5684,
        "shareCount": 8,
        "engagementRate": 0.10010555946516538
      },
      "index": 148
    },
    {
      "id": "7171095918320684330",
      "text": " The Machine Preacher Curl is one of the best exercises you can do to grow your biceps. But let me show you how to make them even better. A lot of the time when doing this exercise, people grip the bar towards the middle of the handles, which is perfectly fine to do. But if you want to better target the short head of the bicep giving you that inner peak, placing your hands towards the outside of the handles provides a much better alignment for the short head. Save this video and give it a try. This literally gave me stretch marks in my biceps.",
      "stats": {
        "commentCount": 27,
        "diggCount": 3384,
        "playCount": 34600,
        "shareCount": 50,
        "engagementRate": 0.10002890173410404
      },
      "index": 149
    },
    {
      "id": "7115416982698298670",
      "text": "",
      "stats": {
        "commentCount": 29,
        "diggCount": 518,
        "playCount": 5732,
        "shareCount": 26,
        "engagementRate": 0.09996510816468947
      },
      "index": 150
    },
    {
      "id": "7069102702516571435",
      "text": " Want wings without Red Bull? Try these exercises!",
      "stats": {
        "commentCount": 8,
        "diggCount": 159,
        "playCount": 1790,
        "shareCount": 11,
        "engagementRate": 0.09944134078212291
      },
      "index": 151
    },
    {
      "id": "7108841372714618155",
      "text": " Do you want insane vascularity? Take glycerol before going to the gym. Thank me later.",
      "stats": {
        "commentCount": 9,
        "diggCount": 574,
        "playCount": 6077,
        "shareCount": 19,
        "engagementRate": 0.09906203718940267
      },
      "index": 152
    },
    {
      "id": "7095435906286423338",
      "text": " Let's go party!",
      "stats": {
        "commentCount": 14,
        "diggCount": 224,
        "playCount": 2684,
        "shareCount": 27,
        "engagementRate": 0.09873323397913562
      },
      "index": 153
    },
    {
      "id": "7065842837635468591",
      "text": " Want to naturally boost testosterone?",
      "stats": {
        "commentCount": 23,
        "diggCount": 573,
        "playCount": 6200,
        "shareCount": 16,
        "engagementRate": 0.09870967741935484
      },
      "index": 154
    },
    {
      "id": "7082850327090728235",
      "text": " If you're under 140 pounds, you should not be cutting.",
      "stats": {
        "commentCount": 38,
        "diggCount": 418,
        "playCount": 4776,
        "shareCount": 14,
        "engagementRate": 0.09840871021775545
      },
      "index": 155
    },
    {
      "id": "7085843394056031530",
      "text": " Bro, I'm gonna sleep. Bro, how much weight you got on there? Bro, it's just so boring, bro. What the fuck? Damn, and his pants, too. This is so boring, bro.",
      "stats": {
        "commentCount": 659,
        "diggCount": 273200,
        "playCount": 2800000,
        "shareCount": 588,
        "engagementRate": 0.09801678571428571
      },
      "index": 156
    },
    {
      "id": "7089129864183205162",
      "text": " If you're not eating at least 0.5 grams of protein per pound of body mass, you're killing your game.",
      "stats": {
        "commentCount": 22,
        "diggCount": 406,
        "playCount": 4574,
        "shareCount": 19,
        "engagementRate": 0.09772627896808045
      },
      "index": 157
    },
    {
      "id": "7088340146260708654",
      "text": " I can't wait to finally look big in clothes!",
      "stats": {
        "commentCount": 13,
        "diggCount": 234,
        "playCount": 2748,
        "shareCount": 21,
        "engagementRate": 0.0975254730713246
      },
      "index": 158
    },
    {
      "id": "7143258595851881771",
      "text": " If you want your arms to go from this to this, save this routine for your next arm day. We're gonna be starting out with either an incline or standard dumbbell curl, moving on to a hammer curl to target that brachialis and add some width onto the arms, and finishing up biceps with my personal favorite exercise, the machine preacher curl, going slow and controlled on the eccentric portion of the rep. Starting out with triceps, we have the cross body cable extension, moving on to heavy V bar push downs. This is where a majority of that tricep mass is gonna come from, and finishing up with incline skull crushers to target that lateral head of the tricep. Last but not least, we have the overhead dumbbell press, followed by lateral raises, leaning slightly forward to really add some size onto that medial delt. Do three sets of eight to 12 reps on each exercise, and you will literally have some massive arms.",
      "stats": {
        "commentCount": 51,
        "diggCount": 4458,
        "playCount": 47000,
        "shareCount": 71,
        "engagementRate": 0.09744680851063829
      },
      "index": 159
    },
    {
      "id": "7119471888107113771",
      "text": " Maxing out machines at Planet Fitness.",
      "stats": {
        "commentCount": 121,
        "diggCount": 57100,
        "playCount": 588700,
        "shareCount": 63,
        "engagementRate": 0.09730592831662986
      },
      "index": 160
    },
    {
      "id": "7154794300746812714",
      "text": " Can we talk about why commercial gyms never have good machines like this? Instead they'll have like three of these. Who is using this? Why was 600 treadmills included in the budget but not a decent chess machine?",
      "stats": {
        "commentCount": 218,
        "diggCount": 60100,
        "playCount": 624300,
        "shareCount": 161,
        "engagementRate": 0.09687489988787441
      },
      "index": 161
    },
    {
      "id": "7114295960204840234",
      "text": " Hey, wanna listen to some tunes? I've heard so many dudes say that they're afraid to wear straps because they don't want their grip strength to be weak. If you're deadlifting 300 plus pounds, your forearms are simply not designed to hold that much weight for reps. There's nothing wrong with using straps to help you train more intensely on one exercise. If you're scared of weak forearms, you can train those separately. There's no reason why you should fear lifting straps.",
      "stats": {
        "commentCount": 20,
        "diggCount": 397,
        "playCount": 4632,
        "shareCount": 31,
        "engagementRate": 0.09671848013816926
      },
      "index": 162
    },
    {
      "id": "7154407904404163883",
      "text": " Nobody cares how big your chest is. When compared to the other pressing muscles, the shoulders of the- Flat press, incline dumbbell, cable flys, shoulder press, lateral raises, crossbody cable extension, tricep pushdowns. Heavy and controlled, 3 sets of 6-10 reps.",
      "stats": {
        "commentCount": 352,
        "diggCount": 201600,
        "playCount": 2100000,
        "shareCount": 864,
        "engagementRate": 0.09657904761904762
      },
      "index": 163
    },
    {
      "id": "7174118405610638634",
      "text": " Bibble, you're a genius! Bicep curls 101. Always keep your back stable, never swing the weight. Keep the weight in the palm of your hand rather than towards your fingers. Lock your elbows in place to keep tension on the biceps. Always lower the weights lower on the eccentric portion of the rep.",
      "stats": {
        "commentCount": 15,
        "diggCount": 4632,
        "playCount": 48900,
        "shareCount": 52,
        "engagementRate": 0.09609406952965235
      },
      "index": 164
    },
    {
      "id": "7157022880239242539",
      "text": " because you have a six-pack it doesn't mean you have a strong core a six-pack purely just means that you have a very low body cable crunch hanging leg raise garhammers calorie deficit slow and controlled recess of 8 to 12 reps",
      "stats": {
        "commentCount": 62,
        "diggCount": 13200,
        "playCount": 138900,
        "shareCount": 77,
        "engagementRate": 0.09603311735061196
      },
      "index": 165
    },
    {
      "id": "7090975064228760878",
      "text": " I think I remember those eyes, eyes, eyes, eyes, eyes Cause you're the sunlight I'd take you to warned you",
      "stats": {
        "commentCount": 25,
        "diggCount": 691,
        "playCount": 7629,
        "shareCount": 16,
        "engagementRate": 0.09594966574911522
      },
      "index": 166
    },
    {
      "id": "7149930223939669294",
      "text": " Lap pull down, cable row, seated machine row. Only 3 exercises you need to build an insane back. Heavy and controlled to recess at 6-10 reps.",
      "stats": {
        "commentCount": 615,
        "diggCount": 219400,
        "playCount": 2300000,
        "shareCount": 612,
        "engagementRate": 0.09592478260869565
      },
      "index": 167
    },
    {
      "id": "7167085046745140523",
      "text": " education heads since I do steroids. Yeah, so those aren't allowed. The sports that I do, boxing or WWE. I gotta agree with Logan on this one. John Cena is a prime example of a natural WWE wrestler. You know, cuz steroids aren't allowed in the WWE, so he probably just did a lemon water diet for 30 days and some push-ups to obtain this.",
      "stats": {
        "commentCount": 26,
        "diggCount": 2629,
        "playCount": 28000,
        "shareCount": 26,
        "engagementRate": 0.09575
      },
      "index": 168
    },
    {
      "id": "7137339663580204331",
      "text": " chest to go from this to this stop doing 15 sets. The only three exercises you need to build an absolutely massive chest are some form of flat bench press, incline dumbbell press, and cable flys. Do three sets of eight to twelve reps on each exercise and you will literally have a massive chest.",
      "stats": {
        "commentCount": 109,
        "diggCount": 17300,
        "playCount": 183500,
        "shareCount": 127,
        "engagementRate": 0.09556403269754768
      },
      "index": 169
    },
    {
      "id": "7151805343683611947",
      "text": " Wrist curls, reverse curls. Heavy and controlled 3 sets of 8-12 reps.",
      "stats": {
        "commentCount": 76,
        "diggCount": 34900,
        "playCount": 367400,
        "shareCount": 78,
        "engagementRate": 0.09541099618943931
      },
      "index": 170
    },
    {
      "id": "7125863511405743402",
      "text": " A question I get all the time is how many rest days should you have per week? If you're somewhat of a new lifter in the gym, I wouldn't recommend training 6 days a week. This is because your body isn't quite used to working out yet, so you definitely don't want to overtrain and burn out too quickly. For new lifters, I would recommend anywhere between 3-4 rest days per week. And over time, as your body adapts, you can lessen the amount of rest days you're taking.",
      "stats": {
        "commentCount": 20,
        "diggCount": 1227,
        "playCount": 13300,
        "shareCount": 21,
        "engagementRate": 0.09533834586466165
      },
      "index": 171
    },
    {
      "id": "7158520629073923371",
      "text": " Machine press, incline dumbbell, cable flys, lap pull down, cable row, seated machine row. Heavy and controlled, 3 sets of 6-10 reps.",
      "stats": {
        "commentCount": 42,
        "diggCount": 5480,
        "playCount": 58600,
        "shareCount": 56,
        "engagementRate": 0.09518771331058021
      },
      "index": 172
    },
    {
      "id": "7178156823986392363",
      "text": " Here it's because then you see me like I would not stay These are absolutely phenomenal for growing your biceps. Using a slight bit of momentum when curling the bar allows you to load up a lot more weight when going slower on the eccentric portion of the rep. These will give you an amazing stretch on those muscle fibers. I would highly recommend this exercise.",
      "stats": {
        "commentCount": 82,
        "diggCount": 37400,
        "playCount": 395500,
        "shareCount": 97,
        "engagementRate": 0.0950164348925411
      },
      "index": 173
    },
    {
      "id": "7105429275548912942",
      "text": " This goes without saying, but be extremely careful when you're doing these. I'm specifically not a big fan of this exercise, especially going super wide out in the bottom portion of that rep. When you're getting up to those heavier weights like he's using in this video, it is crucial that you have good form or else you're risking a pec tear.",
      "stats": {
        "commentCount": 4,
        "diggCount": 266,
        "playCount": 3074,
        "shareCount": 22,
        "engagementRate": 0.09499024072869226
      },
      "index": 174
    },
    {
      "id": "7156588712854392106",
      "text": " People ask me, they'll be like, Casey, what is your bicep workout? Incline curl, cable hammer curl, machine preacher curl, heavy and controlled recess of 6-10 reps.",
      "stats": {
        "commentCount": 54,
        "diggCount": 9359,
        "playCount": 99800,
        "shareCount": 62,
        "engagementRate": 0.09493987975951904
      },
      "index": 175
    },
    {
      "id": "7127345389371428142",
      "text": " If you're trying to put on some serious muscle and you're working within the 12-15 rep range, the next time you're in the gym, increase the weight until you can only do about 8-10 reps. A lot of the time we short sell ourselves and save energy so we can do those 15 reps. But if you're going heavy and all out in the 8-10 rep range, you will make some insane progress.",
      "stats": {
        "commentCount": 11,
        "diggCount": 603,
        "playCount": 6722,
        "shareCount": 24,
        "engagementRate": 0.0949122285034216
      },
      "index": 176
    },
    {
      "id": "7113548209280126251",
      "text": " And exercise I regret not doing as a beginner in the gym, tricep addition. Single arm feeble extensions.",
      "stats": {
        "commentCount": 36,
        "diggCount": 2873,
        "playCount": 31100,
        "shareCount": 40,
        "engagementRate": 0.09482315112540193
      },
      "index": 177
    },
    {
      "id": "7164481154966392110",
      "text": " Today we're gonna be looking at this 100% natural physique. Just do a lemon water diet for 30 days in these rice rows, heavy and controlled 3 sets of 8-12 reps and you can obtain this.",
      "stats": {
        "commentCount": 24,
        "diggCount": 2372,
        "playCount": 25600,
        "shareCount": 30,
        "engagementRate": 0.094765625
      },
      "index": 178
    },
    {
      "id": "7159606132804193582",
      "text": " This applies for all exercises. If you want to optimize muscle growth, you should always be going slower on the eccentric portion of the rep.",
      "stats": {
        "commentCount": 28,
        "diggCount": 16000,
        "playCount": 169800,
        "shareCount": 63,
        "engagementRate": 0.09476442873969376
      },
      "index": 179
    },
    {
      "id": "7115405818199018798",
      "text": " If you're a hard gainer or someone trying to put on a bunch of weight, should you be eating as many calories as possible? The immediate answer to this question is no, because most of the time, people's first thoughts is I'll just load up on a bunch of junk food and I'll just get a ton of calories in and I'll just gain muscle. But eating a bunch of junk calories, as shown in this video, will not result in the muscle gains you're looking for, especially foods loaded up in sugar and empty carbs. If you're really a hard gainer, you need to be trying to eat as much protein-filled food as possible. Meat, eggs, fish, nuts, anything like that, not sugar, pastries, and junk.",
      "stats": {
        "commentCount": 6,
        "diggCount": 342,
        "playCount": 4015,
        "shareCount": 29,
        "engagementRate": 0.09389788293897883
      },
      "index": 180
    },
    {
      "id": "7068345948346567982",
      "text": " When you're getting bigger, but not stronger.",
      "stats": {
        "commentCount": 55,
        "diggCount": 1175,
        "playCount": 13300,
        "shareCount": 13,
        "engagementRate": 0.09345864661654135
      },
      "index": 181
    },
    {
      "id": "7069851958776991019",
      "text": "",
      "stats": {
        "commentCount": 48,
        "diggCount": 1205,
        "playCount": 13600,
        "shareCount": 18,
        "engagementRate": 0.09345588235294118
      },
      "index": 182
    },
    {
      "id": "7171461392514452778",
      "text": " Well guys, it's official, Liver King is a fake naddy. I mean is anybody really surprised? Derek Moreplates Mardacious did an hour long video exposing emails that he sent over a year ago. Look at this cycle he's taking! Some people thought he was just on HRT, Bro's stack literally looks like a cooking recipe. I mean who would have thought that walking barefoot and eating liver wouldn't get you a physique like this?",
      "stats": {
        "commentCount": 105,
        "diggCount": 9191,
        "playCount": 100900,
        "shareCount": 112,
        "engagementRate": 0.0932408325074331
      },
      "index": 183
    },
    {
      "id": "7168856576344837422",
      "text": " Everybody always talks about the negative side effects of bulking like losing your abs and gaining face fat, but I'm going to be going over some of the benefits. First up, you literally build an absolute dumpy. I mean look at this. Your muscles are just so full from all the extra calories it's amazing. Next up, you get so much stronger when you're bulking. My confidence levels have gone through the roof seeing the weight increasing on all my lifts. And finally, you just get to eat more and don't have to worry about tracking every single calorie. This makes life so much easier and you have a ton of extra energy to train hard in the gym.",
      "stats": {
        "commentCount": 43,
        "diggCount": 8132,
        "playCount": 88300,
        "shareCount": 57,
        "engagementRate": 0.09322763306908267
      },
      "index": 184
    },
    {
      "id": "7115418105945394478",
      "text": " the only time i feel safe train all you want you will gain zero muscle if you're not eating enough protein aim for 0.7 to 1.5 grams of protein per pound of body weight",
      "stats": {
        "commentCount": 22,
        "diggCount": 631,
        "playCount": 7426,
        "shareCount": 38,
        "engagementRate": 0.09305144088338271
      },
      "index": 185
    },
    {
      "id": "7165176045237194027",
      "text": " bro who keeps designing these machines they really put some plates on a rocking chair and called it a day. I am not trying to pop motion sickness pills before I hit a set of legs.",
      "stats": {
        "commentCount": 22,
        "diggCount": 5187,
        "playCount": 56500,
        "shareCount": 37,
        "engagementRate": 0.0928495575221239
      },
      "index": 186
    },
    {
      "id": "7068346309496851758",
      "text": " Want that 3D chest? The only 3 exercises you will need.",
      "stats": {
        "commentCount": 51,
        "diggCount": 1132,
        "playCount": 13100,
        "shareCount": 23,
        "engagementRate": 0.09206106870229008
      },
      "index": 187
    },
    {
      "id": "7173325817672420650",
      "text": " If you are using this attachment for cable rows, let me show you how to make it better. The standard C-to-row attachment puts your hands in a fixed position, which can limit your range of motion and the amount of weight that you're actually able to pull. By attaching two D handles to the cable, as you see here, you are actually able to bring your arms fully back behind your body, and it even allows for a level of pronation at the wrist. This provides a much more comfortable and natural pulling movement to better target the lats. Save this video and give it a try.",
      "stats": {
        "commentCount": 52,
        "diggCount": 5245,
        "playCount": 58500,
        "shareCount": 77,
        "engagementRate": 0.09186324786324786
      },
      "index": 188
    },
    {
      "id": "7105143090775592234",
      "text": " Eating food to gain weight as a skinny person or someone with a fast metabolism doesn't have to be hard. If you eat an abundance of these three foods, you are for sure to gain weight. Alright, first up we got cheese. Cheese is such an easy source of protein and extra calories and it goes so well with eggs or any type of sandwich you're going to make. Next up we got peanut butter. Peanut butter is also very calorie dense food. It has a lot of protein and it's easy to slap on anything. Bananas, oatmeal, whatever you want. Last up we got mass gainer. If you're seriously having problems gaining weight, just add a serving of this to your shake every day. Take me later.",
      "stats": {
        "commentCount": 50,
        "diggCount": 1368,
        "playCount": 16100,
        "shareCount": 50,
        "engagementRate": 0.09118012422360249
      },
      "index": 189
    },
    {
      "id": "7177047476656983342",
      "text": " is walter white couldn't have done it without me bro what there is no way this is real all right here's my controller i like to think that i have decently sized forearms all right let's check this out yo wait a minute what",
      "stats": {
        "commentCount": 17,
        "diggCount": 5023,
        "playCount": 55700,
        "shareCount": 30,
        "engagementRate": 0.09102333931777379
      },
      "index": 190
    },
    {
      "id": "7164807718870551850",
      "text": " If you have this attachment at your gym and you are not using it, you are nerfing your back gains. The handles allow for such a comfortable and natural pulling movement. This is hands down the best lat pulldown attachment.",
      "stats": {
        "commentCount": 82,
        "diggCount": 5290,
        "playCount": 59700,
        "shareCount": 50,
        "engagementRate": 0.09082077051926297
      },
      "index": 191
    },
    {
      "id": "7167851614701718827",
      "text": " How is nobody talking about this transformation? Look at this guy. Yo, I'm at the gym right now, but I just had to respond to this. There is a very small difference in Zac Efron's physique from five years ago in Baywatch. Look at his chest, look at his arms, to now. Look at his chest, look at his arms. The only real difference is his stomach and he's probably just bloated from eating. This guy says he's blasting a ton of drugs, but you gotta remember, these are five years apart. And there's barely any difference.",
      "stats": {
        "commentCount": 24,
        "diggCount": 4475,
        "playCount": 49800,
        "shareCount": 21,
        "engagementRate": 0.09076305220883533
      },
      "index": 192
    },
    {
      "id": "7177448484059024683",
      "text": " Did you really bench press if you don't have this line? Well the line should actually be a little bit lower down in your chest, you probably don't really have a strong bench. Nevermind.",
      "stats": {
        "commentCount": 75,
        "diggCount": 53500,
        "playCount": 592900,
        "shareCount": 93,
        "engagementRate": 0.09051779389441728
      },
      "index": 193
    },
    {
      "id": "7127713520044510510",
      "text": " If you're in your early teens and you're not working out right now, you will regret it. UB gains are 100% a real thing and you can ironically expect to gain the most muscle within your first year of seriously training. Now if you haven't gone through puberty yet, these gains can be amplified even more. Take advantage of the hormones that your body is giving you.",
      "stats": {
        "commentCount": 56,
        "diggCount": 1932,
        "playCount": 22500,
        "shareCount": 45,
        "engagementRate": 0.09035555555555555
      },
      "index": 194
    },
    {
      "id": "7071403204705029419",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 35,
        "diggCount": 388,
        "playCount": 4856,
        "shareCount": 15,
        "engagementRate": 0.09019769357495881
      },
      "index": 195
    },
    {
      "id": "7125514992748596522",
      "text": " Stop spending your money on these fake testosterone boosters thinking that they're going to work like steroids. Especially things like Terquestrone which hasn't even definitively been proven to work. And if it does it will make a very very slight difference in your gains. But do you know what is cheaper and will get you more gains? Protein powder, creatine, pre-workout. Not Terquestrone. Wasting your money.",
      "stats": {
        "commentCount": 19,
        "diggCount": 965,
        "playCount": 11200,
        "shareCount": 23,
        "engagementRate": 0.08991071428571429
      },
      "index": 196
    },
    {
      "id": "7126220896460705067",
      "text": " Once you're able to do 100 consecutive push-ups with relative ease, it's no longer helping your gains. If you want to grow your chest and triceps at home, you can try trying harder variations such as the diamond push-up, or progressively overloading by loading up a backpack full weight.",
      "stats": {
        "commentCount": 14,
        "diggCount": 1032,
        "playCount": 11900,
        "shareCount": 22,
        "engagementRate": 0.08974789915966387
      },
      "index": 197
    },
    {
      "id": "7164818537733688619",
      "text": " can i get a flex logan? i don't know bro logan paul recently claimed that he was 100% natural on a podcast but after seeing this video right here this dude looks absolutely insane even in terrible lighting i mean he has visible 3d delts without even flexing what do you guys think?",
      "stats": {
        "commentCount": 40,
        "diggCount": 2807,
        "playCount": 32100,
        "shareCount": 32,
        "engagementRate": 0.08968847352024922
      },
      "index": 198
    },
    {
      "id": "7185600552011713838",
      "text": " If money's not a problem, buy chicken breast. But if you're on a budget, buy chicken drumsticks. If money's not a problem, these Greek yogurt cups are super convenient. But if you're on a budget, buy the tubs down here instead. If you got the cash, fry up some fish. But if you're on a budget, tuna is a cheap alternative.",
      "stats": {
        "commentCount": 192,
        "diggCount": 37500,
        "playCount": 423700,
        "shareCount": 95,
        "engagementRate": 0.08918338447014397
      },
      "index": 199
    },
    {
      "id": "7139946952359284011",
      "text": " if your goal is to build some massive triceps, heavy bar pushdowns are a completely underrated exercise. yes, while the crossbody cable extension and skull crushers are amazing tricep exercises, if you're not doing some form of heavy bar pushdown, you're missing out on an amazing opportunity for progressive overload.",
      "stats": {
        "commentCount": 47,
        "diggCount": 4035,
        "playCount": 46100,
        "shareCount": 21,
        "engagementRate": 0.08900216919739697
      },
      "index": 200
    },
    {
      "id": "7127717544475233582",
      "text": " Should you do your bicep curls seated or standing? Now unless you're performing an incline curl, the only difference it's going to make is the amount of momentum you're able to use. Sometimes when people do standing bicep curls, they have tendencies to use more momentum than if they were sitting down. Due to this reason, I recommend seated bicep curls because it eliminates that factor of being able to generate momentum. This will allow you to strictly isolate both heads of the bicep and maximize muscle growth.",
      "stats": {
        "commentCount": 9,
        "diggCount": 1283,
        "playCount": 14800,
        "shareCount": 25,
        "engagementRate": 0.08898648648648648
      },
      "index": 201
    },
    {
      "id": "7187492860839824686",
      "text": " If you have skinny legs, you need to be doing this exercise. A lot of the time, people will solely train the quads through squats and leg extensions. But what makes up a lot of the thickness of the legs is the inner thighs and the adductors. Using the hip adduction machine for a few sets until failure will not only increase the overall width of your legs, but can also increase your strength on many of your lifts. Just be careful if you've never used it before, you might not be able to walk the next day.",
      "stats": {
        "commentCount": 164,
        "diggCount": 15900,
        "playCount": 184000,
        "shareCount": 261,
        "engagementRate": 0.08872282608695652
      },
      "index": 202
    },
    {
      "id": "7187075172984311082",
      "text": " Everybody cares how big your legs are if they're not functional. Bodybuilders will have huge legs, but they don't do anything. Leg extensions, packed squat, seated leg curls, and calf raises, but you'll probably skip these. You'll need to hold the recess of 6-10 reps.",
      "stats": {
        "commentCount": 81,
        "diggCount": 7137,
        "playCount": 82600,
        "shareCount": 66,
        "engagementRate": 0.08818401937046005
      },
      "index": 203
    },
    {
      "id": "7171098882602962222",
      "text": " Why do people still not use clips in the gym? If your goal is to train hard in the gym, balancing the bar to prevent plates from sliding off should be the least of your concerns. With that being said, use safety bars, that's what they're there for. Now if you have a home gym and don't have access to safety bars, that's a different story. Without docking your lifts, use protection.",
      "stats": {
        "commentCount": 14,
        "diggCount": 2612,
        "playCount": 30200,
        "shareCount": 28,
        "engagementRate": 0.08788079470198676
      },
      "index": 204
    },
    {
      "id": "7117981859123825962",
      "text": " Here's how you can tell if you have good ab genetics for aesthetics. If your ab insertions are asymmetrical, it's not seen as the most aesthetic in bodybuilding. This is because aesthetics is all about symmetry, so it's not ideal, but it still looks pretty good. Next up we have the 4-pack ab. If you're sub 10% body fat and you can still only see the top 4 abs, it's not viewed as the most aesthetic in bodybuilding, but as you can see with overall muscle imbalance it can still look incredible. Next up we have dudes like David Lay with perfect symmetrical 6-pack abs. If you have a symmetrical 6-pack, this is seen as like the pinnacle of aesthetics, especially paired with dominant obliques and a v-taper. Last but not least we have the 8-pack abs. If you have a full, clear, asymmetrical 8-pack of abs, you are absolutely genetically blessed.",
      "stats": {
        "commentCount": 61,
        "diggCount": 5228,
        "playCount": 60500,
        "shareCount": 27,
        "engagementRate": 0.08786776859504132
      },
      "index": 205
    },
    {
      "id": "7123205479941229870",
      "text": " Soreness can be a great sign of growth and an indicator that your muscles have been broken down and now they're repairing themselves. But should you be chasing soreness after every single workout? The short answer to that question is no. If you're not feeling sore after a workout, it doesn't mean that you didn't train hard enough. And in fact, constant soreness can be a sign of overtraining, which ironically would be hindering your progress. So just because you aren't sore doesn't mean that you're not growing.",
      "stats": {
        "commentCount": 10,
        "diggCount": 625,
        "playCount": 7643,
        "shareCount": 36,
        "engagementRate": 0.08779275153735444
      },
      "index": 206
    },
    {
      "id": "7122908962965605678",
      "text": " oh yeah combine that exercise with machine preacher curls with some form of hammer curls and you will literally have massive biceps",
      "stats": {
        "commentCount": 283,
        "diggCount": 46400,
        "playCount": 536900,
        "shareCount": 377,
        "engagementRate": 0.08765133171912833
      },
      "index": 207
    },
    {
      "id": "7127348035071380782",
      "text": " If you're trying to build some insane shoulders, you shouldn't only be spamming lateral raises. Make sure you're doing dumbbell overhead press going as heavy as possible with good form. These blew my shoulders up like crazy.",
      "stats": {
        "commentCount": 50,
        "diggCount": 8613,
        "playCount": 99700,
        "shareCount": 64,
        "engagementRate": 0.08753259779338014
      },
      "index": 208
    },
    {
      "id": "7124352714179398954",
      "text": " just load it as heavy as possible and press with both arms. Combine that exercise with inside dumbbell press and some form of chest fly and you will literally have a massive chest.",
      "stats": {
        "commentCount": 181,
        "diggCount": 37500,
        "playCount": 435000,
        "shareCount": 297,
        "engagementRate": 0.08730574712643678
      },
      "index": 209
    },
    {
      "id": "7152187708226489643",
      "text": " Spider curls have recently been gaining a lot of popularity and are a great way to train the biceps in the shortened position, but they can be a bit awkward to set up. A great alternative would be a machine or easy bar creature curl. These are an amazing way to blow up your biceps.",
      "stats": {
        "commentCount": 37,
        "diggCount": 10000,
        "playCount": 115400,
        "shareCount": 38,
        "engagementRate": 0.0873050259965338
      },
      "index": 210
    },
    {
      "id": "7168542812181466410",
      "text": " If you experience shoulder pain while working out, I got you. A lot of the time we have strong deltoid muscles because of our shoulder movements. But what's actually causing pain is weakened muscles around the rotator cuff. Grab a resistance band, hold it about shoulder width apart. Right about waist level, I want you to practice these pulling movements. I also want you to practice them over your head as well. And you can even practice these shoulder mobility exercises by moving the band around your body. What this is gonna do is help actually strengthen those rotator cuff muscles, help prevent shoulder injuries in the future, and help relieve that shoulder pain. This only needs to be done about 15 minutes before your push days in particular. Go ahead and try these out.",
      "stats": {
        "commentCount": 15,
        "diggCount": 1480,
        "playCount": 17700,
        "shareCount": 49,
        "engagementRate": 0.0872316384180791
      },
      "index": 211
    },
    {
      "id": "7086900861552708907",
      "text": " when you're getting stronger but not bigger.",
      "stats": {
        "commentCount": 95,
        "diggCount": 3873,
        "playCount": 45900,
        "shareCount": 32,
        "engagementRate": 0.08714596949891068
      },
      "index": 212
    },
    {
      "id": "7178935747041594670",
      "text": " If you are bulking, eat peanut butter. For cutting, eat powdered peanut butter. If you are bulking, eat cheese. For cutting, get the reduced fat. If you're bulking, it's okay to use sugar. For cutting, stick with the sweeteners. If you're bulking, use sauces and dressings. But for cutting, use hot sauce and mustard.",
      "stats": {
        "commentCount": 31,
        "diggCount": 5495,
        "playCount": 64000,
        "shareCount": 51,
        "engagementRate": 0.087140625
      },
      "index": 213
    },
    {
      "id": "7076835568390425902",
      "text": " Thank you for watching!",
      "stats": {
        "commentCount": 82,
        "diggCount": 1483,
        "playCount": 18200,
        "shareCount": 18,
        "engagementRate": 0.08697802197802197
      },
      "index": 214
    },
    {
      "id": "7136962398325427498",
      "text": " If you're suffering from skinny quads and can't seem to add on size to your legs, you need to be hitting the hip abduction machine. This is going to target the adductors and give you that inner thickness on the quads.",
      "stats": {
        "commentCount": 32,
        "diggCount": 2375,
        "playCount": 28100,
        "shareCount": 34,
        "engagementRate": 0.08686832740213524
      },
      "index": 215
    },
    {
      "id": "7178163491331722538",
      "text": " wear a black wife beater to the gym you are the most aesthetic person is it just me or did we all wear like super deep cut stringers when first starting out in the gym it had to be name brand and show off as much skin as possible but as we gained more muscle and experience in the gym we all kind of reverted back to the plain black tank which is weird because when you had less you wanted to show off more but now the more you want to show off less i don't know something about it just looks way more appealing to me",
      "stats": {
        "commentCount": 42,
        "diggCount": 8499,
        "playCount": 99700,
        "shareCount": 43,
        "engagementRate": 0.08609829488465397
      },
      "index": 216
    },
    {
      "id": "7091716739406368043",
      "text": " me from this to this and that's L-glutamine. This is the... I gotta call out the cap when I see it. L-glutamine is not some magical supplement that's going to shrink down your stomach. Many bodybuilders use it to help aid in muscle recovery. I've taken it in the past. While it may aid in some bloating and digestive problems, it's not what she's making it out to be in this video.",
      "stats": {
        "commentCount": 3,
        "diggCount": 145,
        "playCount": 1932,
        "shareCount": 18,
        "engagementRate": 0.08592132505175984
      },
      "index": 217
    },
    {
      "id": "7182989481308556590",
      "text": " If money's not a problem, buy steak. But if you're on a budget, buy ground beef in bulk. If money's not a problem, nuts are a great high protein snack. But if you're on a budget, I would stick with peanut butter. If you got the cash, grab some fresh salmon. But if you're on a budget, frozen tilapia is a great alternative.",
      "stats": {
        "commentCount": 394,
        "diggCount": 53000,
        "playCount": 623600,
        "shareCount": 171,
        "engagementRate": 0.08589640795381655
      },
      "index": 218
    },
    {
      "id": "7176288215635217707",
      "text": " Dang, this dude's about to bench 400 pounds. I gotta see how good his form is. Alright, let's check this out. Reduce your expectations.",
      "stats": {
        "commentCount": 157,
        "diggCount": 73700,
        "playCount": 866800,
        "shareCount": 411,
        "engagementRate": 0.08568066451315182
      },
      "index": 219
    },
    {
      "id": "7164810422485339434",
      "text": " So you want some massive shoulders, but you only have dumbbells. I got you. Overhead press for front delts, lateral raises for side delts, and reverse flys for rear delts. These are best performed chest supported. Do three sets until failure on each exercise and you will literally have some massive shoulders.",
      "stats": {
        "commentCount": 33,
        "diggCount": 1598,
        "playCount": 19400,
        "shareCount": 31,
        "engagementRate": 0.0856701030927835
      },
      "index": 220
    },
    {
      "id": "7162909929634827562",
      "text": " What part of the back is your pull-down attachment really working? This is going to bias more of the lats, however it's not my favorite due to the close hand positioning. The standard pull-down attachment is going to involve more of the upper back, however the lats can be incorporated more by leaning slightly back and widening your grip. This is also a great attachment for the lats due to the pronated hand positioning, but it largely comes down to how you're actually performing the exercise. And finally, my favorite attachments. These handles provide a much more comfortable and natural grip for pulling, and are great for incorporating both the lats and upper back.",
      "stats": {
        "commentCount": 25,
        "diggCount": 4876,
        "playCount": 57900,
        "shareCount": 42,
        "engagementRate": 0.0853713298791019
      },
      "index": 221
    },
    {
      "id": "7158894764765498670",
      "text": " The reason your chest is looking skinny as shit is because you're neglecting the lower part of the chest. Not exactly. If you're doing any sort of flat pressing movement, you are already hitting the lower chest. And the reason why a lot of dudes have this droopy chest look from the side is because there's a lot of muscle down here and not a lot of muscle up here. I would argue that the upper chest is oftentimes more neglected. This is because you're typically a lot stronger with flat press than incline. If you want that overall full look, you gotta be hitting the upper chest.",
      "stats": {
        "commentCount": 334,
        "diggCount": 93300,
        "playCount": 1100000,
        "shareCount": 248,
        "engagementRate": 0.08534727272727273
      },
      "index": 222
    },
    {
      "id": "7145149928916978990",
      "text": " If you want to build an insane V taper, save this chest and back routine. We're going to be starting out with any variation of flat bench press to target the middle chest. Moving on to an incline dumbbell press at about 30 degrees to target that upper chest. Finishing up with cable flys to target that mid to lower chest. Starting out our back exercises, we have the lat pull down to target those upper lat fibers. Moving on to a cable machine row, leaning slightly forward to target those mid to lower lat fibers. Finishing up with a seated machine row, going slow and controlled to really blow up those lats. Three sets of eight to 12 reps in each exercise and you have the ultimate chest and back day.",
      "stats": {
        "commentCount": 22,
        "diggCount": 4125,
        "playCount": 50000,
        "shareCount": 59,
        "engagementRate": 0.08412
      },
      "index": 223
    },
    {
      "id": "7125092167265062190",
      "text": " You do not have to do 3-4 sets on every single exercise. If you're training with true intensity, 2 sets on a certain exercise is perfectly fine. Especially on days where you're doing 4 or more exercises for a single muscle group, it would take you hours in the gym if you were doing 3-4 sets on every single exercise. Not to mention, it's hard to train with real intensity if you're saving your energy for that 4th set.",
      "stats": {
        "commentCount": 22,
        "diggCount": 918,
        "playCount": 11500,
        "shareCount": 27,
        "engagementRate": 0.08408695652173913
      },
      "index": 224
    },
    {
      "id": "7186304061464005934",
      "text": " I always see people using this machine and I never understand how to use it. Preacher curls 101. Make sure you adjust the seat height so your elbows are not resting on the pad like this. Instead, the pad should be tucked into your armpits to create the most isolation on the biceps. Also make sure you're going slow and controlled when lowering the weight. And never max out or eagle lift to prevent what happened here.",
      "stats": {
        "commentCount": 149,
        "diggCount": 30800,
        "playCount": 369900,
        "shareCount": 137,
        "engagementRate": 0.08403892944038929
      },
      "index": 225
    },
    {
      "id": "7116994589403155758",
      "text": " Excuse why you can't get that protein anyone that's trying to get that protein in check this out Grab two of these Protein shakes are a great way to meet your macro goals problem with a lot of the pre-made ones like he's showing in this video Is they're really expensive and could be like three four dollars per can it might not seem a lot at first But if you want to have one of these a day that quickly adds up personally I've been going with these equates shakes from Walmart. It's 30 grams of protein you get 12 of them and it's only around $18 that comes out to roughly a dollar fifty per serving and they taste pretty decent if you want to save even more money body Fortress way is a great option. It's 30 grams of protein you get 17 servings and it's about $23 which averages out to around a dollar thirty per serving. However, this is not already ready to drink and I don't really like the taste as much",
      "stats": {
        "commentCount": 17,
        "diggCount": 1367,
        "playCount": 16900,
        "shareCount": 34,
        "engagementRate": 0.08390532544378698
      },
      "index": 226
    },
    {
      "id": "7131479061330824494",
      "text": " Back exercise tier list, let's go. Coming in first, I'm putting the lat pulldown in A tier. Very solid exercise, and one you should be doing on your back days. Although it targets more of the teres muscles rather than the lats, it will still help you develop an insane V taper. Next up, I'm putting the T-bar row in A tier. Whether you do these chest supported or standing, this is an amazing exercise for developing your back. Next up, I'm gonna have to put the deadlift in C tier. A lot of people might be upset with that placement, and while deadlifts are great for strengthening your lower back, they are just not optimal for muscle hypertrophy. Next up, the barbell row is going in a solid B tier. Great overall movement when performed correctly, but hard to progressively overload while maintaining good form and safety. Next up, I'm throwing the seated machine row in a well-deserved A tier. This is one of my all-time favorite back exercises, and really allows you to isolate the lats and load up a lot of weight. This next one might be controversial, but I'm putting pull-ups in S tier. For this one, I'm specifically referring to weighted pull-ups which are absolutely incredible for developing size and width onto your lats. And they target pretty much all of the muscles in the back. Let me know what muscle group you guys want to see in the next tier list.",
      "stats": {
        "commentCount": 360,
        "diggCount": 54000,
        "playCount": 650500,
        "shareCount": 209,
        "engagementRate": 0.08388777863182167
      },
      "index": 227
    },
    {
      "id": "7183378536428817707",
      "text": " low calorie food substitutes that will help you get absolutely shredded. Instead of eating ground beef, you can eat ground turkey, sugar-free syrup instead of the regular kind, plain Greek yogurt instead of sour cream, and water sweeteners instead of juice.",
      "stats": {
        "commentCount": 13,
        "diggCount": 2694,
        "playCount": 32800,
        "shareCount": 42,
        "engagementRate": 0.0838109756097561
      },
      "index": 228
    },
    {
      "id": "7114676499046960430",
      "text": " Yes, it actually will. Here are my credentials. The hip abduction machine actually targets the gluteus medius. This is a muscle that runs directly underneath the gluteus maximus. Using the hip abduction machine will add overall size and width onto your glutes.",
      "stats": {
        "commentCount": 32,
        "diggCount": 517,
        "playCount": 6754,
        "shareCount": 17,
        "engagementRate": 0.08380219129404798
      },
      "index": 229
    },
    {
      "id": "7178934617133567275",
      "text": " At least it's about a few keeps I'm trippin' Walking on an incline treadmill is better than running. For a lot of people, let me explain. If you're like me, running absolutely sucks and you dread doing it as a form of cardio. But you can burn just as many calories doing this for a longer period of time, which is much more tolerable in my opinion. Putting on some YouTube or Netflix makes this a lot more enjoyable.",
      "stats": {
        "commentCount": 31,
        "diggCount": 3048,
        "playCount": 37500,
        "shareCount": 47,
        "engagementRate": 0.08336
      },
      "index": 230
    },
    {
      "id": "7123187718263180587",
      "text": " Should you be doing pec flies with a machine or with cables? Well it honestly depends a lot on your preference. A lot of people would argue that the machine pec flies don't allow for your arms to cross over your midsection, as seen in this photo. However, while having that extra range of motion may have some benefits on your chest, it's not going to make that big of a difference. Since both movements are pretty similar, I recommend doing whatever one feels best for you.",
      "stats": {
        "commentCount": 12,
        "diggCount": 1134,
        "playCount": 13900,
        "shareCount": 3,
        "engagementRate": 0.08266187050359712
      },
      "index": 231
    },
    {
      "id": "7105877289069628718",
      "text": " All my tears have been stolen",
      "stats": {
        "commentCount": 151,
        "diggCount": 1406,
        "playCount": 19100,
        "shareCount": 20,
        "engagementRate": 0.082565445026178
      },
      "index": 232
    },
    {
      "id": "7178578591465131306",
      "text": " If you're bulking, eat pasta. For cutting, eat rice. If you're bulking, eat bacon. For cutting, eat turkey bacon. This is halal. If you're bulking, cook with butter. But for cutting, cook with spray oil.",
      "stats": {
        "commentCount": 112,
        "diggCount": 20500,
        "playCount": 251300,
        "shareCount": 93,
        "engagementRate": 0.08239156386788699
      },
      "index": 233
    },
    {
      "id": "7114300215816932651",
      "text": " You suffer from small calves. All you gotta do is a thousand calf raises a day and you'll have some massive calves. Sorry to say, that's not how it works. The size of your calf heavily depends on the insertion. I'm sure you've seen random people out in public who have massive calves that have never done a calf raise in their entire life. This is probably because they have low inserting calves, which just makes the muscle body look a lot bigger. An example would be Seth Feroze. Now obviously this guy trains calves, but his genetics are just absolutely insane. I mean look at his two year old daughter in this pic. You think his two year old daughter is doing calf raises? No, it's because of the insertions that got passed on through the genetics. So while it is possible to grow your calves through calf raises, don't expect to be going from this to this.",
      "stats": {
        "commentCount": 138,
        "diggCount": 15700,
        "playCount": 193600,
        "shareCount": 108,
        "engagementRate": 0.08236570247933885
      },
      "index": 234
    },
    {
      "id": "7187824918929624363",
      "text": " The standard rope tricep pushdown limits the range of motion to just about the front of the body. However, the function of the tricep allows for a much greater range of motion. When he does the exercise unilaterally, the length of the rope increases, which in turn increases his range of motion to about the size of his body. This can also be done with a long rope or two separate ropes.",
      "stats": {
        "commentCount": 28,
        "diggCount": 4678,
        "playCount": 58000,
        "shareCount": 60,
        "engagementRate": 0.08217241379310344
      },
      "index": 235
    },
    {
      "id": "7129241516823842090",
      "text": " This is why you need to stop only drinking water. Water is simply- He goes on to try to sell some electrolyte sodium supplement. If you're a high performing athlete electrolytes are 100% necessary. But if you're an ordinary gym goer, unless you're having like some crazy muscle spasms or cramps, you're probably consuming enough sodium and potassium in your diet and don't need to go out of your way to buy some other supplement.",
      "stats": {
        "commentCount": 11,
        "diggCount": 1135,
        "playCount": 14300,
        "shareCount": 28,
        "engagementRate": 0.0820979020979021
      },
      "index": 236
    },
    {
      "id": "7122153287368854830",
      "text": " Here are three things you might be doing wrong on squat. The first thing, and probably the most common amongst beginners, is not hitting full depth and only going down a quarter of the way. I'm sure a lot of us have been here at some point and find it a lot easier to do more weight on the squat when you're only going down a quarter of the way. However, if you want to train squats optimally, you need to be hitting at least a 90 degree angle. Your hips should be in line with your knees. The second thing I always see is setting up your squat like this. The barbell squat is a compound movement that requires a lot of stability muscles. This includes bracing your upper body. In order to gain proper stability on a squat, you need to have your shoulders retracted and your chest up rather than being hunched over. Last mistake you might be making is bringing your knees inwards when you're going in the bottom portion of the rep. This is called knee valgus and is commonly caused from weak abductor muscles. I recommend training with a hip abductor machine and lowering the weight on squat to improve your form.",
      "stats": {
        "commentCount": 11,
        "diggCount": 800,
        "playCount": 10300,
        "shareCount": 34,
        "engagementRate": 0.08203883495145631
      },
      "index": 237
    },
    {
      "id": "7062368864994217262",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 79,
        "diggCount": 1041,
        "playCount": 13900,
        "shareCount": 16,
        "engagementRate": 0.08172661870503597
      },
      "index": 238
    },
    {
      "id": "7113919213794020654",
      "text": " An exercise I regret not doing as a beginner in the gym, chest edition. Incline Jungle Press",
      "stats": {
        "commentCount": 8,
        "diggCount": 498,
        "playCount": 6578,
        "shareCount": 31,
        "engagementRate": 0.08163575554879902
      },
      "index": 239
    },
    {
      "id": "7137334810661440814",
      "text": " Do you suffer from a small back? The number one exercise to transform my back from this to this right here is the unilateral seated machine row. If you're not training these to a failure, I would highly recommend incorporating them on your back day.",
      "stats": {
        "commentCount": 28,
        "diggCount": 1841,
        "playCount": 23400,
        "shareCount": 34,
        "engagementRate": 0.08132478632478632
      },
      "index": 240
    },
    {
      "id": "7141443497952988462",
      "text": " Find a split to put on size. Monday, is it okay to train each muscle only once a week? The answer is yes If you're a beginner in the gym because you're gonna have newbie gains on your side as you become more advanced your muscles are gonna Get used to that stimulus and need to be trained more frequently to put on size This is why Arnold or PPL splits are much better because it allows you to hit every muscle twice a week",
      "stats": {
        "commentCount": 20,
        "diggCount": 2971,
        "playCount": 37300,
        "shareCount": 42,
        "engagementRate": 0.08131367292225201
      },
      "index": 241
    },
    {
      "id": "7114286161396370731",
      "text": " there's some validity in what this guy is saying. if your goal is to train until absolute failure on every set, you should not be able to crank out the same amount of reps just two minutes later, especially not for four sets total. now it is possible to do four sets of 12 with real intensity, it's just that most of the time people reach that 12th rep and then they stop even though they have like five or six more left in the tank. this is because they want to save energy for their next set of 12. i personally train until absolute failure on most exercises, so i like to start at 12 and then lose like one or two reps every set.",
      "stats": {
        "commentCount": 16,
        "diggCount": 487,
        "playCount": 6483,
        "shareCount": 24,
        "engagementRate": 0.08128952645380225
      },
      "index": 242
    },
    {
      "id": "7095814584241622315",
      "text": " Yo, listen up boys you want the lobster claw triceps you need to be doing this exercise This single arm cable tricep pulldown has literally added so much mass to my triceps. It's insane",
      "stats": {
        "commentCount": 12,
        "diggCount": 242,
        "playCount": 3460,
        "shareCount": 27,
        "engagementRate": 0.08121387283236994
      },
      "index": 243
    },
    {
      "id": "7162561965280267562",
      "text": " If you get fat bulking, you did it wrong. Not exactly. You definitely shouldn't dirty bulk and just eat a bunch of junk food. But if you're in a proper calorie surplus in order to maximize muscle gain, you should be gaining a noticeable amount of fat. Otherwise, you're probably closer to your maintenance or in a deficit, which is perfectly fine for muscle growth. It's just not the most optimal.",
      "stats": {
        "commentCount": 35,
        "diggCount": 1985,
        "playCount": 25300,
        "shareCount": 28,
        "engagementRate": 0.08094861660079052
      },
      "index": 244
    },
    {
      "id": "7095730690066550059",
      "text": " Yo, I've been getting a lot of comments asking me if the SUS machine was good, and it's good if you want thick quads. So most people already have the developed vastus medialis and the developed vastus lateralis giving you that teardrop shape. But if you want to add some width onto your quads, you're going to want to target the adductors. That's all SUS machine right there.",
      "stats": {
        "commentCount": 15,
        "diggCount": 557,
        "playCount": 7716,
        "shareCount": 52,
        "engagementRate": 0.08087091757387248
      },
      "index": 245
    },
    {
      "id": "7116988709932846382",
      "text": " shape is the strongest sign of physical attraction in men the better your shoulders to waist yet here's how you can tell if you have good lat genetics for aesthetics that's really come down to two types of insertions high versus low you're somebody that suffers with wider hips or a wider waist the higher lat insertions will look better on you this is because when people have a thicker waist but lower lat insertions it gives them more of this blocky look instead of a V taper here's somebody with a smaller waist pretty much either insertion will look good on you because no matter where the lat inserts it still comes down to that V tapered shape this is why typically a smaller waist is seen as more aesthetic and bodybuilding regardless even if you don't have the V taper that you necessarily want proper training and diet can bring those lats out",
      "stats": {
        "commentCount": 85,
        "diggCount": 24200,
        "playCount": 301900,
        "shareCount": 128,
        "engagementRate": 0.08086452467704539
      },
      "index": 246
    },
    {
      "id": "7156233909716438315",
      "text": " How do you explain to the doctor that you tore your ACL while benching?",
      "stats": {
        "commentCount": 66,
        "diggCount": 6190,
        "playCount": 79400,
        "shareCount": 158,
        "engagementRate": 0.0807808564231738
      },
      "index": 247
    },
    {
      "id": "7147674178248903982",
      "text": " the best exercise to grow your triceps as fa-",
      "stats": {
        "commentCount": 45,
        "diggCount": 4866,
        "playCount": 62000,
        "shareCount": 72,
        "engagementRate": 0.08037096774193549
      },
      "index": 248
    },
    {
      "id": "7126976430772210987",
      "text": " Here are three things you can do to alleviate knee pain on leg pressing movements. First thing you can do is slow eccentrics on a leg extension machine. This is the bottom portion of the rep, which basically you're slowly lowering the weight down. This can help strengthen your knees and alleviate some of that pain. The second thing I would recommend is sled pulling. Many studies have shown that sled pulling can actually have regenerative effects on your knee joint. The last thing I would recommend for knee pain is taking some time off from heavy leg pressing movements. Sometimes we push ourselves too hard in the gym and our joints simply cannot catch up. Taking some time off from these heavy compound movements is sometimes what your body needs to fully recover.",
      "stats": {
        "commentCount": 6,
        "diggCount": 528,
        "playCount": 6962,
        "shareCount": 25,
        "engagementRate": 0.08029301924734272
      },
      "index": 249
    },
    {
      "id": "7139949726958357802",
      "text": " Are dumbbells better than barbell chest presses? Whether you're talking about incline or flat presses, the answer is going to be yes if you're training for muscle hypertrophy. Using dumbbells is going to require more stability within your arms, which is going to make the exercise a lot harder. However, they allow for a greater range of motion, giving you an amazing stretch in your chest fibers. So if your goal is to solely build muscle, I would go with the dumbbell variation.",
      "stats": {
        "commentCount": 20,
        "diggCount": 1195,
        "playCount": 15600,
        "shareCount": 33,
        "engagementRate": 0.08
      },
      "index": 250
    },
    {
      "id": "7139942363564084526",
      "text": " If you want your back to go from this to this, save this routine for your next pull day. Coming up first we have a lat pulldown to target more of that upper back and teres muscles. Next up we have the cable row, leaning slightly forward to be better aligned with those mid to low lat fibers. The last back exercise is the unilateral seated machine row, going heavy and controlled to really add size onto those lats. Starting out with our bicep exercises, you can either do a standard or incline dumbbell curl. Moving on to a hammer dumbbell curl to target more of that brachialis, giving you that width onto the biceps. And finishing up with my personal favorite exercise, the machine preacher curl. Do 8-12 reps on each exercise and you will literally have a massive back and biceps.",
      "stats": {
        "commentCount": 64,
        "diggCount": 4964,
        "playCount": 63800,
        "shareCount": 73,
        "engagementRate": 0.07995297805642633
      },
      "index": 251
    },
    {
      "id": "7134733789741288750",
      "text": " There are actually no inherent advantages to doing curls with a straight bar. In fact, if you're having problems with your arms swimming in your t-shirts, doing bicep curls with your wrists slightly bent outwards can actually help better target both heads of the bicep and take tension off the brachialis, giving you more width onto the arms.",
      "stats": {
        "commentCount": 33,
        "diggCount": 4899,
        "playCount": 62400,
        "shareCount": 39,
        "engagementRate": 0.07966346153846154
      },
      "index": 252
    },
    {
      "id": "7125512702503456042",
      "text": " Combine that exercise with cable rear delt flies and some form of overhead press and you will literally have some massive shoulders.",
      "stats": {
        "commentCount": 88,
        "diggCount": 48700,
        "playCount": 615600,
        "shareCount": 249,
        "engagementRate": 0.0796572449642625
      },
      "index": 253
    },
    {
      "id": "7114276694080376107",
      "text": " At gym rat space, I recommend Skiffic.",
      "stats": {
        "commentCount": 20,
        "diggCount": 509,
        "playCount": 6881,
        "shareCount": 18,
        "engagementRate": 0.0794942595552972
      },
      "index": 254
    },
    {
      "id": "7155124623586102574",
      "text": " Legolasz Anabolic Steroid. Leg Extension, Hack Squat, Leg Press, Seated Leg Curl, RDLs. Heavy and controlled through sets of 6-10 reps.",
      "stats": {
        "commentCount": 84,
        "diggCount": 11200,
        "playCount": 143900,
        "shareCount": 110,
        "engagementRate": 0.07917998610145935
      },
      "index": 255
    },
    {
      "id": "7158116833768246571",
      "text": " Props to that dude for pushing that much weight. But what is Lil Dude in the back gonna do if he drops that?",
      "stats": {
        "commentCount": 35,
        "diggCount": 2757,
        "playCount": 35600,
        "shareCount": 23,
        "engagementRate": 0.07907303370786517
      },
      "index": 256
    },
    {
      "id": "7136960456824016171",
      "text": " keep your pants up when you're performing it's incredible. Should you be working out on an empty stomach? The answer is no if you want to have the most energy and pump in the gym. Eating fast-digesting carbs before the gym like a Rice Krispie treat or banana will increase your overall performance and give you an insane pump.",
      "stats": {
        "commentCount": 10,
        "diggCount": 1067,
        "playCount": 14000,
        "shareCount": 28,
        "engagementRate": 0.07892857142857143
      },
      "index": 257
    },
    {
      "id": "7186309397210107182",
      "text": " You should always shoulder press with a slight incline rather than straight up at 90 degrees. It allows for better bracing stability and alignment with the front delt and can even mitigate shoulder pain that you may experience with this exercise.",
      "stats": {
        "commentCount": 11,
        "diggCount": 2224,
        "playCount": 29000,
        "shareCount": 50,
        "engagementRate": 0.07879310344827586
      },
      "index": 258
    },
    {
      "id": "7098421909045529899",
      "text": " Vaping decreases vascularity.",
      "stats": {
        "commentCount": 249,
        "diggCount": 5107,
        "playCount": 73600,
        "shareCount": 423,
        "engagementRate": 0.07851902173913043
      },
      "index": 259
    },
    {
      "id": "7160339876037135658",
      "text": " Did you know that there's a difference between torso versus arm dominant in bodybuilding? This is commonly talked about in the fitness community and refers to someone's arms being a lot more dominant than their chest and back, or vice versa. An example would be Tristan Lee. Tristan Lee has insane arm genetics, but his chest and back have never been able to catch up to that same standard. And it largely comes down to insertions and the overall appearance of the muscle body. On the opposite side of the spectrum, you have dudes like Alex Eubank. He's practically known for his chest, but his arms aren't as dominant in comparison. I'm personally like Alex where my back and chest have always been miles above my arms. Let me know what you guys think.",
      "stats": {
        "commentCount": 139,
        "diggCount": 8742,
        "playCount": 114900,
        "shareCount": 122,
        "engagementRate": 0.07835509138381201
      },
      "index": 260
    },
    {
      "id": "7161866827881024811",
      "text": " Spamming lateral raises. The amount of times I will go to the gym and see a dude with 10 pound dumbbells doing 100 lateral raises. Shoulders like any other muscle need to be trained with intensity to grow. If you are able to do more than 15 reps of good form up the weight.",
      "stats": {
        "commentCount": 46,
        "diggCount": 5710,
        "playCount": 74000,
        "shareCount": 36,
        "engagementRate": 0.07827027027027027
      },
      "index": 261
    },
    {
      "id": "7122912937211153707",
      "text": " think okay I'm just gonna move my hand to move the weight and then I'll feel my muscles work. Here are three things you might be doing wrong on the bicep curl. The first thing goes along with what he was talking about in this video and that is simply moving the weight up to your arm but not actually contracting your bicep. If you are not actively feeling your biceps contracting while you're curling you are hindering your results and need to focus on my muscle connection. The second thing I always see in the gym is people leaning back when they're doing bicep curls. This is not an exercise you want to be using momentum for. In order to get the most out of this workout you need to have strict form and locked elbows. Last mistake you might be making is bringing your elbows in front of your body too much. When your elbow comes up like this you're starting to take tension off the bicep. In order to really feel that contraction you want to keep your elbows locked and down to your side.",
      "stats": {
        "commentCount": 3,
        "diggCount": 858,
        "playCount": 11400,
        "shareCount": 30,
        "engagementRate": 0.0781578947368421
      },
      "index": 262
    },
    {
      "id": "7141439159868132651",
      "text": " If you want your legs to go from this to this, save this routine for your next leg day. You wanna start out with a compound exercise. This could be a squat, a leg press, or a hack squat. Going heavy but controlled to really target those quads. Then you wanna switch over to some form of RDL, really feeling the stretch on the hamstrings. Moving on to isolations, we have the leg extension to really fire up those quads. N-seated leg curl for the hamstrings, really going slow on the eccentric portion of the rep. Next up is the hip adduction machine to really add some width onto your legs, finishing up with calf raises, going heavy and controlled throughout the entire range of motion. Do three sets of eight to 12 reps on each exercise and you will literally have some massive legs.",
      "stats": {
        "commentCount": 40,
        "diggCount": 3240,
        "playCount": 43000,
        "shareCount": 74,
        "engagementRate": 0.078
      },
      "index": 263
    },
    {
      "id": "7158517900507139370",
      "text": " Whether you sleep 6 hours or 9 hours, it won't make a difference. How much sleep you need for muscle growth is heavily case dependent. For some people like myself, getting only 6 hours of sleep will severely hinder my progress. That doesn't apply to everyone. As a general rule of thumb, if you want to maximize your gains, you should be getting more sleep.",
      "stats": {
        "commentCount": 20,
        "diggCount": 2810,
        "playCount": 36700,
        "shareCount": 31,
        "engagementRate": 0.07795640326975477
      },
      "index": 264
    },
    {
      "id": "7126218597210361134",
      "text": " Don't get me wrong, that's a great bicep movement, but the machine preacher curls hands down the best bicep exercise.",
      "stats": {
        "commentCount": 41,
        "diggCount": 1414,
        "playCount": 19100,
        "shareCount": 29,
        "engagementRate": 0.07769633507853403
      },
      "index": 265
    },
    {
      "id": "7167091090225532206",
      "text": " Does your squat PR on the Smith Machine count? Well, regardless of the resistance that you saw in the actual bar in those two videos, barbell squats and Smith Machine squats are going to be completely different in terms of stabilization. So it is very unlikely that you'll be able to push the same amount of weight for both. For this reason, in terms of PRs, you should categorize them separately.",
      "stats": {
        "commentCount": 25,
        "diggCount": 5354,
        "playCount": 69600,
        "shareCount": 28,
        "engagementRate": 0.0776867816091954
      },
      "index": 266
    },
    {
      "id": "7080671047795920174",
      "text": " Who would win the olympia?",
      "stats": {
        "commentCount": 85,
        "diggCount": 763,
        "playCount": 11100,
        "shareCount": 14,
        "engagementRate": 0.07765765765765766
      },
      "index": 267
    },
    {
      "id": "7183370061950831915",
      "text": " If you experience elbow pain on any variation of Skullcrusher, give Overhead Rope Extensions a try. By setting the machine at about head height, you will mitigate a lot of that excess strain placed on your elbows.",
      "stats": {
        "commentCount": 9,
        "diggCount": 2457,
        "playCount": 32100,
        "shareCount": 26,
        "engagementRate": 0.07763239875389408
      },
      "index": 268
    },
    {
      "id": "7118743719108578606",
      "text": " Maxing out machines at Planet Fitness.",
      "stats": {
        "commentCount": 60,
        "diggCount": 19400,
        "playCount": 252500,
        "shareCount": 47,
        "engagementRate": 0.07725544554455445
      },
      "index": 269
    },
    {
      "id": "7108464815328349486",
      "text": " Did you know that there's a large difference between torso versus arm dominant and bodybuilding? This is actually something super commonly talked about in the fitness community and refers to somebody's arms or torso rapidly growing a lot more than the other. As an example, we have Tristin Lee. Tristin Lee has insane arm genetics, but his chest and back have just never really been able to catch up to that same standard. I'm personally very torso dominant, meaning my chest and lats have always been miles above my arms. At the end of the day, it really comes down to genetics and muscle insertions, so don't feel bad if you're feeling a little asymmetrical. While it's still going crazy though.",
      "stats": {
        "commentCount": 82,
        "diggCount": 1903,
        "playCount": 26600,
        "shareCount": 61,
        "engagementRate": 0.0769172932330827
      },
      "index": 270
    },
    {
      "id": "7140682119868714283",
      "text": " If you want your chest to go from this to this, save this routine for your next push day. We're gonna be starting out with either a flat dumbbell or barbell bench press to target that middle chest. Then moving on to an incline dumbbell press to hit the upper chest to give you that full look. Finishing up with a chest exercise, we have a cable fly set about mid height, going slow and controlled to really target that mid to lower chest. Starting out with our shoulder exercise, we have an overhead dumbbell press to target that front delt. Then moving on to a seated dumbbell lateral raise, leaning slightly forward to target more of that medial delt. Finishing up with reverse cable flies to really target that rear delt. Starting on our tricep exercises with a cross body cable extension to really hit that long head of the tricep. Moving on to heavy V bar push downs. This is where a lot of that tricep mass is gonna come from. You do not want to skip out on these. And if you want some extra volume to target that short head of the tricep, you can also throw in an incline skull crusher. Do three sets of eight to 12 reps on each exercise and you literally have the ultimate push day.",
      "stats": {
        "commentCount": 75,
        "diggCount": 7686,
        "playCount": 102500,
        "shareCount": 109,
        "engagementRate": 0.07678048780487805
      },
      "index": 271
    },
    {
      "id": "7152181953960234282",
      "text": " 30 degrees for upper chest, 75 degrees for front delts and incline curls.",
      "stats": {
        "commentCount": 70,
        "diggCount": 14700,
        "playCount": 194200,
        "shareCount": 93,
        "engagementRate": 0.07653450051493306
      },
      "index": 272
    },
    {
      "id": "7129594563907325227",
      "text": " If you think training biceps is boring, you need to be doing machine preacher curls. This is my favorite exercise and these blew up my biceps.",
      "stats": {
        "commentCount": 57,
        "diggCount": 3369,
        "playCount": 45300,
        "shareCount": 28,
        "engagementRate": 0.07624724061810155
      },
      "index": 273
    },
    {
      "id": "7184477886915595562",
      "text": " Calves not only look unathletic, but are unathletic, and it's literally a fact. Supress at the standing calf raise machine with the seated version right after. Heavy and controlled through sets of 8-12 reps until failure.",
      "stats": {
        "commentCount": 87,
        "diggCount": 7697,
        "playCount": 103500,
        "shareCount": 43,
        "engagementRate": 0.0756231884057971
      },
      "index": 274
    },
    {
      "id": "7117349032451738922",
      "text": "",
      "stats": {
        "commentCount": 4,
        "diggCount": 617,
        "playCount": 8509,
        "shareCount": 22,
        "engagementRate": 0.07556704665648137
      },
      "index": 275
    },
    {
      "id": "7165917159774866734",
      "text": " It's actually not something that I would eat. Tuna is really high in mercury. Tuna is perfectly fine to consume in moderation and is an amazing food to help you build muscle. With 20 grams of protein and only 90 calories, this is a great hack to hit your macro goals.",
      "stats": {
        "commentCount": 77,
        "diggCount": 3440,
        "playCount": 47200,
        "shareCount": 26,
        "engagementRate": 0.0750635593220339
      },
      "index": 276
    },
    {
      "id": "7138515798351662382",
      "text": " I don't make mistakes. I'm not just like the rest of you. There's no doubt that the lateral raise is an amazing exercise for adding size onto your shoulders. Or should you be doing them with cables or dumbbells? Doing cable lateral raises allows you to keep tension on the delt throughout the entire range of motion. However, doing them with free weights allows you to generate a slight bit of momentum, which could be helpful for progressive overload. It really comes down to which movement feels best for you because that's gonna allow you to progress further in the exercise long term.",
      "stats": {
        "commentCount": 31,
        "diggCount": 1088,
        "playCount": 15500,
        "shareCount": 43,
        "engagementRate": 0.07496774193548388
      },
      "index": 277
    },
    {
      "id": "7127715254087224622",
      "text": " The only thing that you have to do to lose fat is be in a caloric deficit. In that video he says track your macros, train multiple times a week, get plenty of water, plenty of rest. Yes, those things will definitely help you lose fat, but none of that will matter if you're not in a caloric deficit.",
      "stats": {
        "commentCount": 5,
        "diggCount": 631,
        "playCount": 8816,
        "shareCount": 23,
        "engagementRate": 0.07475045372050816
      },
      "index": 278
    },
    {
      "id": "7146617163493690667",
      "text": " Training biceps was so boring to me until I found the Machine Preacher Girl. This is literally my favorite exercise now. It gives you an insane pump and really allows you to progressively overload both heads of the bicep.",
      "stats": {
        "commentCount": 28,
        "diggCount": 3470,
        "playCount": 47500,
        "shareCount": 28,
        "engagementRate": 0.07423157894736843
      },
      "index": 279
    },
    {
      "id": "7122906607213776174",
      "text": " I'm not really sure why it's become a trend on this app to hate on push pull legs. When I literally went from this to this in about a year of solid training with push pull legs. I've tried other splits in the past, Arnold, Bro splits, upper lower, but I personally haven't found better results with any other split than PPL. What works for some people doesn't always work for others. So don't feel pressured to change your workout split just because others don't consider it as optimal.",
      "stats": {
        "commentCount": 21,
        "diggCount": 618,
        "playCount": 8857,
        "shareCount": 18,
        "engagementRate": 0.07417861578412555
      },
      "index": 280
    },
    {
      "id": "7096931833669127470",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 11,
        "diggCount": 245,
        "playCount": 3790,
        "shareCount": 25,
        "engagementRate": 0.07414248021108179
      },
      "index": 281
    },
    {
      "id": "7155128113335258410",
      "text": " If you are only using dumbbells to train biceps right now, I would highly recommend throwing in some variation of cable curl. I personally replaced my dumbbell hammer curls with this variation right here. Amazing pump and keeps tension on the bicep throughout the entire range of motion.",
      "stats": {
        "commentCount": 99,
        "diggCount": 20100,
        "playCount": 274700,
        "shareCount": 135,
        "engagementRate": 0.07402257007644704
      },
      "index": 282
    },
    {
      "id": "7126605399960194350",
      "text": " commonly see is the depth of rest. So it is very important to be getting the full range of motion with exercises like overhead dumbbell press. However, if you feel like you don't have that full shoulder mobility for exercises like incline press, don't force yourself to lower that bar all the way down to your chest. Never sacrifice safety for range of motion. This applies for things like leg press and squat as well because what you don't want is a repeat of what happened in this video.",
      "stats": {
        "commentCount": 5,
        "diggCount": 504,
        "playCount": 7206,
        "shareCount": 24,
        "engagementRate": 0.0739661393283375
      },
      "index": 283
    },
    {
      "id": "7148483329828949294",
      "text": " countdown of the top four methods to grow your chest. You need to press flat bench for mid chest, incline dumbbell press for upper chest, cable flyes for lower chest, heavy and controlled 3 sets of 6-10 reps.",
      "stats": {
        "commentCount": 56,
        "diggCount": 5419,
        "playCount": 75100,
        "shareCount": 79,
        "engagementRate": 0.07395472703062583
      },
      "index": 284
    },
    {
      "id": "7101802986497723694",
      "text": " what each angle means. At 30, you'll be targeting your upper chest. Please stop setting up your bench past 45 degrees. If you're doing incline dumbbell press to solely hit your upper chest, even 45 degrees is kind of pushing it. And especially anything past that, you're incorporating all front delts. I prefer the 30 degrees like he's talking about in this video. That's how you're gonna get the best recruitment from the upper chest and not the front delts.",
      "stats": {
        "commentCount": 4,
        "diggCount": 500,
        "playCount": 7213,
        "shareCount": 26,
        "engagementRate": 0.07347844170248163
      },
      "index": 285
    },
    {
      "id": "7129976667577044267",
      "text": " Today we have a bicep exercise tier list. All right, first up we got incline curls, automatic S tier. An overall amazing exercise and allows for a greater stretch on the bicep than a standard dumbbell curl would. Next up, I'm gonna be putting chin ups in B tier. Still a great exercise for biceps, but it doesn't really allow you to isolate the biceps as much and incorporates a lot of the back muscles. Next up, we got machine creature curls. This is my favorite exercise, automatic S tier. These allow for incredible isolations on the bicep, are extremely fun to do and give you an insane pump. All right, next up we have reverse curls, and I'm gonna go ahead and throw this one in B tier. Overall great movement, but target more of the brachialis and forearms. Next up, we have free rate creature curls. Gonna go ahead and toss that right there. All right, the standard dumbbell bicep curl. I think this is a definite A. Great overall movement, targets both heads of the bicep. It just doesn't allow for as great of range of motion as the incline curl. Let me know down in the comments if you guys wanna see the rest of the tier list.",
      "stats": {
        "commentCount": 53,
        "diggCount": 3219,
        "playCount": 45400,
        "shareCount": 59,
        "engagementRate": 0.07337004405286343
      },
      "index": 286
    },
    {
      "id": "7126972327954337070",
      "text": " 400 milligrams of caffeine. Stop taking a ton of caffeine if you want sick pumps in the gym. Not only is it unnecessary for performance, like most other stimulants, caffeine is vasoconstrictor, which means it narrows your blood vessels. I recommend taking no more than 250 milligrams of caffeine if you want sick pumps in the gym.",
      "stats": {
        "commentCount": 31,
        "diggCount": 657,
        "playCount": 9671,
        "shareCount": 20,
        "engagementRate": 0.07320856167924723
      },
      "index": 287
    },
    {
      "id": "7158515511494528298",
      "text": " This is completely true if you have great chest genetics, but if chest is an area where you're lacking, I would highly recommend incorporating a third exercise like a flat pressing movement.",
      "stats": {
        "commentCount": 20,
        "diggCount": 3198,
        "playCount": 44500,
        "shareCount": 35,
        "engagementRate": 0.07310112359550562
      },
      "index": 288
    },
    {
      "id": "7119103819622960427",
      "text": " If you want bigger biceps, do not do this workout. He goes on to list 14 sets of bicep exercises. There is no reason why your biceps need this much volume on a single workout, and training that much can actually hinder your bicep growth. I recommend doing 6-9 sets of bicep exercises maximum in a single workout. I personally would go with 2-3 sets of a standard curl, 2-3 sets of a machine creature curl, and then either 2-3 sets of an easy bar curl or some variation of hammer curl.",
      "stats": {
        "commentCount": 50,
        "diggCount": 2256,
        "playCount": 32100,
        "shareCount": 40,
        "engagementRate": 0.07308411214953271
      },
      "index": 289
    },
    {
      "id": "7125089914869321002",
      "text": " or on more level with the shoulder, you'd be working more of the middle lap. Combine that exercise with lat pull downs and some form of bent over row and you will literally have a massive back.",
      "stats": {
        "commentCount": 61,
        "diggCount": 7659,
        "playCount": 106400,
        "shareCount": 56,
        "engagementRate": 0.07308270676691729
      },
      "index": 290
    },
    {
      "id": "7170764958060383530",
      "text": " If you are using this attachment for tricep extensions, let me show you how to make it better. The standard rope attachment only allows you to extend your arms just to about the size of your body. However, the function of the tricep actually allows for a much greater range of motion. By combining two ropes to the cable machine as you see here, you are able to extend your arms fully back behind your body. This is the best tricep contraction I've ever felt. Go ahead and save this and give it a try.",
      "stats": {
        "commentCount": 86,
        "diggCount": 12100,
        "playCount": 168700,
        "shareCount": 106,
        "engagementRate": 0.07286307053941908
      },
      "index": 291
    },
    {
      "id": "7158115900728626474",
      "text": " Spamming lateral raises doesn't mean doing a whole bunch of junk volume. If you're able to do more than 15 reps with good form, up the weight.",
      "stats": {
        "commentCount": 79,
        "diggCount": 21800,
        "playCount": 300900,
        "shareCount": 34,
        "engagementRate": 0.07282485875706214
      },
      "index": 292
    },
    {
      "id": "7121718599953157418",
      "text": " Gonna make a lot of people mad by saying this, but taking BCAs and creatine is not gonna make much difference on your physique at all. I know it's super popular on TikTok to make it seem like these supplements work like steroids. A lot of people say, oh I gained this X amount of muscle on creatine, oh I got this from creatine. chances are you didn't gain that muscle from creatine. You gained that muscle because you were actively working hard in the gym, where if you were to put the same amount of work in and not take creatine, the muscle gains would probably be the same. Yes, these supplements can help you fine-tune parts of your physique, but you are not going to see any night and day changes.",
      "stats": {
        "commentCount": 28,
        "diggCount": 658,
        "playCount": 9841,
        "shareCount": 28,
        "engagementRate": 0.07255360227619144
      },
      "index": 293
    },
    {
      "id": "7132222391459188014",
      "text": " Tricep exercise tier list, let's go. Coming in first, I'm putting the standard bar tricep pushdown in B tier. This is a great foundational tricep exercise, but using a bar attachment limits your range of motion and doesn't allow your arms to come fully back behind your body, which is a major function of the tricep. Next up, I'm putting the close grip bench press in the A tier category. This is an amazing tricep exercise and allows you to progressively overload without mobility issues. Speaking of mobility issues, I'm putting the overhead dumbbell tricep extension all the way down in the C tier category. While this exercise does target all three heads of the tricep, it puts a lot of strain on your elbows and rotator cuffs, meaning not a lot of people can perform these comfortably. Next up, I'm going to have to place the dip all the way up in A tier. Dips are an incredible exercise for building your triceps and have brought my arms where they are today. Next up, I'm going to have to put the dumbbell tricep kickback all the way down in D tier. Another exercise that puts a lot of strain on the rotator cuff and doesn't effectively target the heads of the tricep. I recommend doing these with cables instead. Coming in first in the S tier category is the single arm cable tricep extension. This movement allows the arm to come completely back behind the body. It also allows you to progressively overload with minimal joint pain. Last but not least, cold crushers are going to go all the way up in A tier. If you don't have problems with joint pain, this is an incredible exercise to put on some mass on your triceps. Let me know what muscle group you guys want to see next.",
      "stats": {
        "commentCount": 138,
        "diggCount": 18100,
        "playCount": 253100,
        "shareCount": 112,
        "engagementRate": 0.07250098775187673
      },
      "index": 294
    },
    {
      "id": "7110183315205836078",
      "text": " Absolutely no amount of chest exercises are going to transform your chest from that. Without losing body fat, you're not going to see much of a difference. Also, the dude in the first video has gyno and the dude in the second video doesn't.",
      "stats": {
        "commentCount": 8,
        "diggCount": 235,
        "playCount": 3675,
        "shareCount": 22,
        "engagementRate": 0.07210884353741497
      },
      "index": 295
    },
    {
      "id": "7129593859700493614",
      "text": " Yeah, so many people on my page saying that they want big forearms. What a lot of people don't understand is you don't necessarily have to train your forearms directly. Bicep exercises like reverse curls and hammer curls indirectly target the forearms.",
      "stats": {
        "commentCount": 14,
        "diggCount": 943,
        "playCount": 13600,
        "shareCount": 23,
        "engagementRate": 0.07205882352941176
      },
      "index": 296
    },
    {
      "id": "7097742239043947818",
      "text": " Please stop doing this exercise.",
      "stats": {
        "commentCount": 33,
        "diggCount": 656,
        "playCount": 10000,
        "shareCount": 29,
        "engagementRate": 0.0718
      },
      "index": 297
    },
    {
      "id": "7173329199258733867",
      "text": " A lot of people do their lat pull downs like this. Lat pull down 101. Place your hands at a width that feels most comfortable for you. Lean slightly back with your chest up and shoulders retracted. And try to imagine driving your elbows down to your waist, keeping tension throughout the entire range of motion.",
      "stats": {
        "commentCount": 26,
        "diggCount": 5374,
        "playCount": 76000,
        "shareCount": 56,
        "engagementRate": 0.07178947368421053
      },
      "index": 298
    },
    {
      "id": "7135841397185236266",
      "text": " Lat exercise to let's go. First up I'm putting the lat pull down in B tier. Despite its name, any back exercise that involves your arms moving parallel with your body is going to target more of the upper back rather than the lats. For that same reason I'm also putting pull-ups in B tier. Next up I'm going to go ahead and throw the seated row in A tier. Any rowing movement is going to be great for the lats and keeps tension on the muscle throughout the entire exercise. Next up I'm putting the plane pull in S tier, absolutely alpha exercise. If you're pulling a plane you probably have big lats. Next up I'm putting the single arm dumbbell row in B tier. Just because you lose some of that stability and isolation on the muscle by not having it chest supported. Coming up next, when performed correctly the barbell row is an S tier exercise for the lats. Amazing overall movement will add a ton of size to your lats. Coming in A tier is the T bar row. Whether you do these chest supported or standing it does a great job of keeping tension on the lats throughout. Next up I'm going to have to put the seated machine row in S tier. Because the machine is chest supported and you're seated perpendicular to the ground, this exercise has great potential for progressive overload. Next up I'm putting the straight arm pull down in A tier. Very solid lat movement overall and pretty interchangeable with the other A tier exercises. Let me know what type of tier list you guys want to see next.",
      "stats": {
        "commentCount": 30,
        "diggCount": 2334,
        "playCount": 33900,
        "shareCount": 58,
        "engagementRate": 0.07144542772861356
      },
      "index": 299
    },
    {
      "id": "7162208967060491566",
      "text": " The most effective way to train these heads for maximum gains is when they are in a stretched position. Both the biceps and triceps do not have to be trained in the stretched position. While exercises like skull crushers and incline curls are perfectly fine to do and can add some variation to your workouts, they are not the most or more effective than the other ranges of motion.",
      "stats": {
        "commentCount": 31,
        "diggCount": 2541,
        "playCount": 36500,
        "shareCount": 32,
        "engagementRate": 0.07134246575342466
      },
      "index": 300
    },
    {
      "id": "7138512620121820459",
      "text": " The only three exercises you need to build some insane triceps. Incline skull crushers, single arm cable tricep extensions, and some form of tricep pushdown. Do three sets of eight to twelve reps on each exercise and you will literally have some massive triceps.",
      "stats": {
        "commentCount": 11,
        "diggCount": 757,
        "playCount": 11400,
        "shareCount": 45,
        "engagementRate": 0.07131578947368421
      },
      "index": 301
    },
    {
      "id": "7111692874772778283",
      "text": " don't cut until you have like two years of training under your belt. He basically goes on to say that you'll look skinny if you cut before actually gaining enough muscle and this is something I really want to talk about. I always get a ton of comics, especially from like younger kids asking me if they should cut or bulk. Listen, I know everybody wants to be shredded, especially seeing all these fitness influencers that are like below 10% body fat and have a six-pack. But what he's saying in this video is kind of right. If you really want to get big and achieve your dream physique with a decent amount of muscle mass, then you are exponentially slowing down your progress by going into a caloric deficit. It's okay to stay around 15% body fat for a couple years. That's a healthy weight.",
      "stats": {
        "commentCount": 60,
        "diggCount": 2506,
        "playCount": 37000,
        "shareCount": 62,
        "engagementRate": 0.07102702702702703
      },
      "index": 302
    },
    {
      "id": "7115410222763511083",
      "text": " If expert is 190 then what is 300 pounds?",
      "stats": {
        "commentCount": 19,
        "diggCount": 464,
        "playCount": 7190,
        "shareCount": 24,
        "engagementRate": 0.07051460361613351
      },
      "index": 303
    },
    {
      "id": "7138517576413400363",
      "text": " If you want to grow a massive chest, do not skip out on the incline dumbbell press. This exercise targets the upper pec fibers and blew up my chest like crazy.",
      "stats": {
        "commentCount": 9,
        "diggCount": 1033,
        "playCount": 15600,
        "shareCount": 45,
        "engagementRate": 0.06967948717948717
      },
      "index": 304
    },
    {
      "id": "7151035598495599915",
      "text": " If you did not go too or near failure on an exercise, do not count it as a working set. A lot of the time people would do 3 sets of 12, increasing the weight every time, but it only really gets difficult on that last set. Those first two sets at lower weight are warm-up sets and should not be included. You need to be doing around 3 intense working sets for most exercises.",
      "stats": {
        "commentCount": 181,
        "diggCount": 26200,
        "playCount": 383400,
        "shareCount": 245,
        "engagementRate": 0.0694470526864893
      },
      "index": 305
    },
    {
      "id": "7154789825579765038",
      "text": " Number one exercise for big arms. And no, it's not a curl, it's the French press. That's an okay exercise for building triceps, definitely not number one. A lot of people experience shoulder and elbow pain doing this movement. If this is you, I would highly recommend switching to incline skull crushers with the long head of the tricep.",
      "stats": {
        "commentCount": 36,
        "diggCount": 9679,
        "playCount": 140600,
        "shareCount": 40,
        "engagementRate": 0.06938122332859174
      },
      "index": 306
    },
    {
      "id": "7114330891823975726",
      "text": " Got this comment on my rep ranges video. And I've actually been asked about progressive overload a lot. In order to grow a muscle, you need to stimulate that muscle. This doesn't mean you do an exercise until it starts to hurt a little bit, it's a little uncomfortable, and then you stop. If you're new in the gym, sure, you'll make gains like that. But after six months to a year of training, you're gonna really need to up the intensity to continue growing. Here's an example of what low intensity looks like. I'm straight faced, not really struggling with this weight. It's kind of easy. This was a warm-up set. This is what real intensity looks like. I'm wincing, I'm struggling. I can barely get this weight up. And as you can see, I almost failed this rep right here. If you want to make some serious gains, this is how you need to train. Stop short selling yourself.",
      "stats": {
        "commentCount": 2,
        "diggCount": 112,
        "playCount": 1991,
        "shareCount": 24,
        "engagementRate": 0.06931190356604722
      },
      "index": 307
    },
    {
      "id": "7133292215786360107",
      "text": " Shoulder exercise tier list, let's go. Coming in first behind the head overhead press is going in D tier. It's not optimal for your delts and puts a lot of strain on the rotator cuffs. Going in a well-deserved S tier is side lateral raises. If you want that 3D delt look, you need to be spamming lateral raises. It's as simple as that. Next up, I'm putting the overhead dumbbell press all the way up in the A tier category. Such an amazing exercise to put on overall size in your front and middle delts. Would highly recommend if you want those bolder shoulders. Next up, I'm gonna have to put the upright row in C tier. Puts a lot of unnecessary torque on the shoulders and there's just so many better exercises to train your front and middle delts. Going in the B tier category is face pulls. Yes, face pulls can help you target that rear delt, but they recruit a lot of help from the upper traps in the movement. Another exercise with that same problem is the reverse pec deck. Due to your hands being parallel with your shoulder, you're gonna get a lot of trap activation in this movement. Next up, I'm putting front delt raises in C tier. Your front delts get trained in almost all your pressing movements and specifically doing another exercise to target them is unnecessary in my opinion. Now the best rear delt exercise is the reverse cable fly, also known as the cable rear delt fly. This is a better version of the reverse pec deck because your arms are coming down at an angle targeting more of that rear delt. Last but not least, the barbell overhead press is going in A tier. Let me know what tier list you guys wanna see next.",
      "stats": {
        "commentCount": 227,
        "diggCount": 24700,
        "playCount": 363500,
        "shareCount": 168,
        "engagementRate": 0.06903713892709766
      },
      "index": 308
    },
    {
      "id": "7129238349600132394",
      "text": " You really don't need to be doing more than three exercises for any muscle group. In some cases, the extra volume can't help. But if you're training two or anywhere near failure, you should not be able to crank out upwards of five different exercises for a single muscle group.",
      "stats": {
        "commentCount": 25,
        "diggCount": 1006,
        "playCount": 15500,
        "shareCount": 38,
        "engagementRate": 0.06896774193548387
      },
      "index": 309
    },
    {
      "id": "7105875904189975850",
      "text": " It won't matter, it won't matter baby It won't matter, it won't matter baby",
      "stats": {
        "commentCount": 7,
        "diggCount": 255,
        "playCount": 4220,
        "shareCount": 28,
        "engagementRate": 0.06872037914691943
      },
      "index": 310
    },
    {
      "id": "7145145778711973166",
      "text": " If you want the most emphasis on the upper chest, 30 degrees is the perfect angle. Anything past that and you'll be incorporating more of the front delts.",
      "stats": {
        "commentCount": 131,
        "diggCount": 22800,
        "playCount": 338300,
        "shareCount": 221,
        "engagementRate": 0.06843629914277269
      },
      "index": 311
    },
    {
      "id": "7183381529542970670",
      "text": " Best exercise for triceps? Alright, let's see what he does. Cross body cable extension? This is actually a very good exercise for triceps. Do you see the align? Wait, wait.",
      "stats": {
        "commentCount": 18,
        "diggCount": 7380,
        "playCount": 109500,
        "shareCount": 63,
        "engagementRate": 0.06813698630136986
      },
      "index": 312
    },
    {
      "id": "7111314001140731178",
      "text": " If you can run from me, you can run from me!",
      "stats": {
        "commentCount": 25,
        "diggCount": 3328,
        "playCount": 49800,
        "shareCount": 28,
        "engagementRate": 0.06789156626506024
      },
      "index": 313
    },
    {
      "id": "7072492916681395502",
      "text": " My favorite tricep finisher.",
      "stats": {
        "commentCount": 179,
        "diggCount": 36500,
        "playCount": 550800,
        "shareCount": 683,
        "engagementRate": 0.0678322440087146
      },
      "index": 314
    },
    {
      "id": "7161859340809456942",
      "text": " metabolic swag. Why do companies make machines like this? If I push myself to failure, I'm falling out of this two story building and breaking my legs.",
      "stats": {
        "commentCount": 42,
        "diggCount": 18500,
        "playCount": 275500,
        "shareCount": 64,
        "engagementRate": 0.06753539019963703
      },
      "index": 315
    },
    {
      "id": "7185592300783897898",
      "text": " These are both perfectly okay to do. This just puts more emphasis on the mid to lower lats, and this will target more of the upper lats.",
      "stats": {
        "commentCount": 39,
        "diggCount": 5993,
        "playCount": 90300,
        "shareCount": 55,
        "engagementRate": 0.06740863787375416
      },
      "index": 316
    },
    {
      "id": "7149937787507100970",
      "text": " This is absolutely true if you're skinny. If you're under 140 pounds, unless you're like 5'3\", you should not be worrying about mane gaining or even cutting. You're not satisfied with your amount of muscle mass and want to put on size? Be in a caloric surplus, eat lots of protein, lift heavy, train until failure. Yes, you might get a little fluffy in the process, but this is the only way you will put on sheer mass. This is the only way you will put on size.",
      "stats": {
        "commentCount": 40,
        "diggCount": 2721,
        "playCount": 42000,
        "shareCount": 45,
        "engagementRate": 0.0668095238095238
      },
      "index": 317
    },
    {
      "id": "7104352945570942251",
      "text": " needed to get a pump during the hike.",
      "stats": {
        "commentCount": 5,
        "diggCount": 262,
        "playCount": 4264,
        "shareCount": 17,
        "engagementRate": 0.06660412757973734
      },
      "index": 318
    },
    {
      "id": "7072494717149351214",
      "text": " What's your goal body fat percentage?",
      "stats": {
        "commentCount": 222,
        "diggCount": 895,
        "playCount": 17100,
        "shareCount": 19,
        "engagementRate": 0.06643274853801169
      },
      "index": 319
    },
    {
      "id": "7097997727698619694",
      "text": " He was playing games, got you dancing in the middle of the club This dude's calves are gonna look the exact same by the end of the year Doing a bunch of junk volume without actually progressively overloading the muscles is not going to grow them at all",
      "stats": {
        "commentCount": 32,
        "diggCount": 1155,
        "playCount": 18400,
        "shareCount": 29,
        "engagementRate": 0.06608695652173913
      },
      "index": 320
    },
    {
      "id": "7126970572772445486",
      "text": " Do not do overhead dumbbell tricep extension. If you're having shoulder and elbow pain doing overhead tricep extensions, I recommend this cross body cable tricep extension. This is an amazing exercise and hits all three heads of the tricep.",
      "stats": {
        "commentCount": 14,
        "diggCount": 1482,
        "playCount": 23300,
        "shareCount": 34,
        "engagementRate": 0.06566523605150215
      },
      "index": 321
    },
    {
      "id": "7137343021888163118",
      "text": " This is definitely one of the best tricep exercises there is, but rather than using a supinated grip, turn your hands to more of a neutral grip to better target all three heads of the tricep.",
      "stats": {
        "commentCount": 43,
        "diggCount": 9088,
        "playCount": 140200,
        "shareCount": 73,
        "engagementRate": 0.0656490727532097
      },
      "index": 322
    },
    {
      "id": "7160344641689177387",
      "text": " If you are not leg pressing like this, you are in fact ego lifting. Stop doing partial reps on leg press. The amount of times I will go to the gym and see somebody load a bunch of plates up on leg press and this will be their range of motion. Your legs should be coming down as low as possible without your spine curving and your butt coming off the seat. If your range of motion is anything less than that, you are wasting your time, lower the weight.",
      "stats": {
        "commentCount": 48,
        "diggCount": 5275,
        "playCount": 82100,
        "shareCount": 53,
        "engagementRate": 0.06548112058465286
      },
      "index": 323
    },
    {
      "id": "7121708263372049710",
      "text": " been aesthetic, jacked, juicy, tanned, and shredded for the past several years. As much as it hurts to say, especially as a natural lifter, muscle gains do plateau. Newbie gains are 100% a real thing, and you can expect to gain the most muscle, ironically in your first year of lifting. And every year after that, you can expect to gain significantly less muscle. People who leave comments like that on John's videos clearly don't know what they're talking about. He has been training for over a decade, and continuing to put on muscle at that point even while enhanced is extremely difficult.",
      "stats": {
        "commentCount": 4,
        "diggCount": 587,
        "playCount": 9402,
        "shareCount": 23,
        "engagementRate": 0.06530525420123379
      },
      "index": 324
    },
    {
      "id": "7114686362405719338",
      "text": " Do you suffer from small arms? Well, it might actually have a lot to do with your genetics. The overall size and appearance of your arm heavily depends on the insertion. So people with smaller looking arms tend to have a large gap between their bicep and their forearm. You can check this by flexing your bicep and seeing how many fingers you can fit in between that space. Sometimes the larger that gap is, the harder it is to fill out that bicep and make it look as big as somebody whose bicep inserts all the way towards the forearm. So don't feel bad if you don't have full big biceps. It might just need a little extra training.",
      "stats": {
        "commentCount": 54,
        "diggCount": 851,
        "playCount": 14500,
        "shareCount": 37,
        "engagementRate": 0.0649655172413793
      },
      "index": 325
    },
    {
      "id": "7145863052217388334",
      "text": " Did you know that utilizing heavy compound movements is key in seeing muscle growth? In order to see serious growth in larger muscle groups, you need to be doing some sort of compound exercise. People were upset in this video that I made because I said your legs won't grow solely from doing leg extensions. Well, the same applies for chest as well. You are not going to get a massive chest from solely doing chest flys or any other isolation. You need to be incorporating some sort of compound exercise if you want to see serious growth. This could be a dumbbell, barbell, or machine press. Compounds are going to be the key to taking your gains to the next level.",
      "stats": {
        "commentCount": 12,
        "diggCount": 1501,
        "playCount": 24000,
        "shareCount": 38,
        "engagementRate": 0.064625
      },
      "index": 326
    },
    {
      "id": "7156580327505317166",
      "text": " never take pre-workout and look the fucking same. personally, coffee does nothing for me. if pre-workout is gonna cause you to be more focused and energized and in turn allow you to train harder, it is 100% a worthy investment in my opinion. because at the end of the day, if you're training sub-optimally, you're going to have sub-optimal results.",
      "stats": {
        "commentCount": 29,
        "diggCount": 2169,
        "playCount": 34500,
        "shareCount": 30,
        "engagementRate": 0.06457971014492754
      },
      "index": 327
    },
    {
      "id": "7153338247064702251",
      "text": " Am I the only one that wishes I was a little bit shorter for muscle building reasons? I mean this is me right now, I'm 6'2, I have a decent amount of muscle mass. Like this is not bad considering how large my frame is. But imagine if I was like 5'6 or 5'7, I feel like I'd be stage ready.",
      "stats": {
        "commentCount": 247,
        "diggCount": 20400,
        "playCount": 321800,
        "shareCount": 78,
        "engagementRate": 0.06440335612181479
      },
      "index": 328
    },
    {
      "id": "7096569613449940270",
      "text": " I think I took curls for the girls a little bit too seriously.",
      "stats": {
        "commentCount": 12,
        "diggCount": 797,
        "playCount": 12900,
        "shareCount": 21,
        "engagementRate": 0.06434108527131784
      },
      "index": 329
    },
    {
      "id": "7124356055110307118",
      "text": " If you notice muscle imbalances and alternating curls, it is most likely because you're starting with the same arm every single time. Whatever arm you start with has less time to rest and is typically your weaker one on curls. This also applies for many other single arm exercises. Switching the arm that you start with should help correct this muscle imbalance.",
      "stats": {
        "commentCount": 39,
        "diggCount": 2255,
        "playCount": 36200,
        "shareCount": 28,
        "engagementRate": 0.06414364640883978
      },
      "index": 330
    },
    {
      "id": "7158850157780553003",
      "text": " Any focus on this program is going to be back, so I'm starting with pull downs. If you're like me and have never seen this attachment in a gym in your life, this is a great common alternative. It doesn't allow for as much pronation of the wrist, but it's still great for biasing the lats.",
      "stats": {
        "commentCount": 38,
        "diggCount": 4069,
        "playCount": 65000,
        "shareCount": 36,
        "engagementRate": 0.06373846153846154
      },
      "index": 331
    },
    {
      "id": "7135150435496873262",
      "text": " So you want to build your side delts the best way to boot your side delts is by doing your ladder raises seated rather than Standing this is going to eliminate a lot of the momentum and the movement allowing you to better isolate the shoulders",
      "stats": {
        "commentCount": 12,
        "diggCount": 889,
        "playCount": 14600,
        "shareCount": 29,
        "engagementRate": 0.0636986301369863
      },
      "index": 332
    },
    {
      "id": "7120243133518155054",
      "text": " Hmm, funny, yes. Here are three things you might be doing wrong on leg press. The first thing and probably the most common is ego lifting and not getting a full range of motion on leg press. It's really easy to load a lot of weight up on the machine when you're only going down a quarter of the way. But not only does this make you at greater risk for injury, it's also not helping your muscle gains at all. Next one I see all the time at the gym is people locking out their legs. Please never ever lock out your legs on leg press. If you've seen this video, you know why. Last mistake I always see is people bringing their knees together on the leg press. This is actually called knee valgus and is usually caused by weak abductor muscles. I recommend using the hip abduction machine to strengthen these muscles, as well as lowering the weight on leg press and really focusing on your form.",
      "stats": {
        "commentCount": 37,
        "diggCount": 2219,
        "playCount": 36200,
        "shareCount": 36,
        "engagementRate": 0.06331491712707182
      },
      "index": 333
    },
    {
      "id": "7112813143738436907",
      "text": " The only time I feel safe You show the lights that stop me turn to stone You show the lights that stop me turn to stone",
      "stats": {
        "commentCount": 103,
        "diggCount": 3307,
        "playCount": 55000,
        "shareCount": 58,
        "engagementRate": 0.06305454545454546
      },
      "index": 334
    },
    {
      "id": "7124733331077418283",
      "text": " Whether you are cutting, bulking, or maintaining muscle protein is extremely important. I recommend consuming 0.5 to 1 gram of protein per pound of body weight.",
      "stats": {
        "commentCount": 18,
        "diggCount": 409,
        "playCount": 7121,
        "shareCount": 21,
        "engagementRate": 0.06291251228760006
      },
      "index": 335
    },
    {
      "id": "7161127644594015534",
      "text": " This is a prime example of overcomplicating training. You would be getting just as much benefit doing regular hammer girls. The brachialis does not need to be trained in the shortened position.",
      "stats": {
        "commentCount": 39,
        "diggCount": 6457,
        "playCount": 104500,
        "shareCount": 26,
        "engagementRate": 0.062411483253588515
      },
      "index": 336
    },
    {
      "id": "7154404205338545454",
      "text": " want crazy veins you need to be doing isometric exercises isometric exercises are inferior when it comes to building muscle and will have no effect on your vascularity if you want more veins you need to be hydrated and lower body fat",
      "stats": {
        "commentCount": 13,
        "diggCount": 2286,
        "playCount": 37400,
        "shareCount": 30,
        "engagementRate": 0.06227272727272727
      },
      "index": 337
    },
    {
      "id": "7118361643809246510",
      "text": " Maxing out machines at Planet Fitness.",
      "stats": {
        "commentCount": 138,
        "diggCount": 34800,
        "playCount": 565100,
        "shareCount": 64,
        "engagementRate": 0.06193947973809945
      },
      "index": 338
    },
    {
      "id": "7172631345615785262",
      "text": " I didn't know! I didn't know!",
      "stats": {
        "commentCount": 316,
        "diggCount": 85400,
        "playCount": 1400000,
        "shareCount": 588,
        "engagementRate": 0.06164571428571428
      },
      "index": 339
    },
    {
      "id": "7145867501719604523",
      "text": " You should never completely sacrifice form to lift more weight. I would 100% agree that you should push yourself over time to progressively overload. But by completely cheating on an exercise to lift more weight, you are simultaneously taking tension off the muscle that you want to work and increasing your risk of injury. Now, partial reps can be a great way to progressively overload, but should only be done once you're approaching failure, not for the entire set.",
      "stats": {
        "commentCount": 18,
        "diggCount": 1435,
        "playCount": 24100,
        "shareCount": 30,
        "engagementRate": 0.061535269709543566
      },
      "index": 340
    },
    {
      "id": "7100597449068154155",
      "text": "",
      "stats": {
        "commentCount": 24,
        "diggCount": 546,
        "playCount": 9728,
        "shareCount": 22,
        "engagementRate": 0.06085526315789474
      },
      "index": 341
    },
    {
      "id": "7141447244229643562",
      "text": " If you want to add some width onto the arms, you need to be training the brachialis. Rather than performing your hammer curls like this, try bringing your arms slightly inwards to better line up with the brachialis. Save this tip for your next bicep day.",
      "stats": {
        "commentCount": 19,
        "diggCount": 2475,
        "playCount": 41700,
        "shareCount": 42,
        "engagementRate": 0.060815347721822545
      },
      "index": 342
    },
    {
      "id": "7151039094087241002",
      "text": " Get rid of belly fat and man boobs, start doing full body splits. In reality, most training sessions, regardless of what split you use, is going to burn around the same amount of calories. Unless you're decreasing rest time or outright doing cardio, doing a full body split isn't going to help you get rid of belly fat or man boobs any more than a bros split or a TPL split would.",
      "stats": {
        "commentCount": 29,
        "diggCount": 4508,
        "playCount": 75400,
        "shareCount": 34,
        "engagementRate": 0.06062334217506631
      },
      "index": 343
    },
    {
      "id": "7138857736837582123",
      "text": " If you are struggling with feeling your lats on back exercises, I would highly recommend performing your rows unilaterally with one arm. This is going to allow you to slightly twist your body in the alignment with the lat muscle fibers during the concentric portion of the rep. Also keeping your elbows tucked and driving them down towards your waist is a great way to help with my muscle connection. Save this tip for your next back day.",
      "stats": {
        "commentCount": 3,
        "diggCount": 567,
        "playCount": 9951,
        "shareCount": 32,
        "engagementRate": 0.06049643251934479
      },
      "index": 344
    },
    {
      "id": "7072890397630025006",
      "text": " Jim bro's worst nightmare",
      "stats": {
        "commentCount": 8,
        "diggCount": 128,
        "playCount": 2478,
        "shareCount": 13,
        "engagementRate": 0.060129136400322844
      },
      "index": 345
    },
    {
      "id": "7134735922704174378",
      "text": " If you don't like setting up for the JPG back exercise, I would highly recommend using the Ciderot machine. By adjusting the chest padding as far back as possible, you can get a full stretching contraction on the lats bringing out that v taper.",
      "stats": {
        "commentCount": 11,
        "diggCount": 1036,
        "playCount": 17900,
        "shareCount": 27,
        "engagementRate": 0.06
      },
      "index": 346
    },
    {
      "id": "7097309741780684078",
      "text": " Win all of your shakers are dirty, but you remember you have a younger sibling.",
      "stats": {
        "commentCount": 3,
        "diggCount": 659,
        "playCount": 11300,
        "shareCount": 16,
        "engagementRate": 0.06
      },
      "index": 347
    },
    {
      "id": "7112806322529160490",
      "text": " to avoid making your waist thicker. This dude's absolutely right. There's really no point in training your obliques unless you're an athlete and need extra core stability and strength. Most of the fitness influencers you see with crazy shredded obliques are not sitting here doing Russian twists, they're just in a calorie deficit.",
      "stats": {
        "commentCount": 11,
        "diggCount": 785,
        "playCount": 13600,
        "shareCount": 17,
        "engagementRate": 0.05977941176470588
      },
      "index": 348
    },
    {
      "id": "7156230504402980142",
      "text": " This also applies to your legs. Now I'm not saying you got to prop your foot up on the bathtub with shaving cream and a razor. Just get a cheap pair of clippers and trim it down a little bit. There's a reason why all your favorite fitness influencers shave their legs because it literally makes you look bigger and leaner at the same time.",
      "stats": {
        "commentCount": 11,
        "diggCount": 2189,
        "playCount": 37200,
        "shareCount": 23,
        "engagementRate": 0.059758064516129035
      },
      "index": 349
    },
    {
      "id": "7136958042532302123",
      "text": " If you want to target the long head of the tricep and grow some massive arms, you need to be doing cross body cable tricep extensions. This exercise blew my arms up like crazy.",
      "stats": {
        "commentCount": 70,
        "diggCount": 10300,
        "playCount": 175100,
        "shareCount": 76,
        "engagementRate": 0.05965733866362079
      },
      "index": 350
    },
    {
      "id": "7182991643136707886",
      "text": " So a lot of people do their dumbbell shoulder presses like this. Dumbbell shoulder press 101. Never use this bench. Only use a bench that provides good back support. Create a slight arch in your back to better brace for the lift, and never fly out your elbows, always keep them tucked.",
      "stats": {
        "commentCount": 52,
        "diggCount": 4403,
        "playCount": 75600,
        "shareCount": 46,
        "engagementRate": 0.059537037037037034
      },
      "index": 351
    },
    {
      "id": "7120589574555962667",
      "text": " Maxing out machines at Planet Fitness.",
      "stats": {
        "commentCount": 50,
        "diggCount": 7586,
        "playCount": 129000,
        "shareCount": 37,
        "engagementRate": 0.05948062015503876
      },
      "index": 352
    },
    {
      "id": "7146614767405288750",
      "text": " But what is training for aesthetics? Like I asked? When someone says they're training for aesthetics, essentially means they're not training like a power lifter. And adding numbers to their lifts is not really their main concern. This does not mean they don't want to get stronger, or only do super low weight for high reps. It just means that they're focused on muscle growth itself. And any strength gains on top of that are an added benefit. I personally find that the best path to hypertrophy is the 8-12 rep range, going as heavy as possible with good form.",
      "stats": {
        "commentCount": 8,
        "diggCount": 1408,
        "playCount": 24300,
        "shareCount": 23,
        "engagementRate": 0.05921810699588478
      },
      "index": 353
    },
    {
      "id": "7125093999387544878",
      "text": " If you're having trouble feeling your rear delt with face pulls, try this cable version of a rear delt fly. You can either do this with both hands or one at a time, but this variation helps target that rear delt a lot more.",
      "stats": {
        "commentCount": 15,
        "diggCount": 586,
        "playCount": 10700,
        "shareCount": 32,
        "engagementRate": 0.0591588785046729
      },
      "index": 354
    },
    {
      "id": "7102871517557427498",
      "text": " Literally, what is the point of doing this? Make my arms go numb!",
      "stats": {
        "commentCount": 11,
        "diggCount": 305,
        "playCount": 5722,
        "shareCount": 22,
        "engagementRate": 0.05907025515554002
      },
      "index": 355
    },
    {
      "id": "7146959333656448299",
      "text": " Never do Smith Machine Squad, there are plenty of- I would argue that the Smith Machine Squad is actually better than the standard barbell squat for muscle hypertrophy. This is because it requires less stabilization from the legs allowing you to progressively overload and toe failure. But then again, what do I know, it's not like Mr. Olympia does them.",
      "stats": {
        "commentCount": 14,
        "diggCount": 2469,
        "playCount": 42900,
        "shareCount": 37,
        "engagementRate": 0.05874125874125874
      },
      "index": 356
    },
    {
      "id": "7145870372498459946",
      "text": " Here's how you work the three different fibers through your chest. He's absolutely right that each variation of chest fly works a different portion of the chest, but I would not combine all three exercises to work your entire chest in a single workout. You would be much better off using the standard variation, combined with some form of incline and flat press to target the other portions of the chest.",
      "stats": {
        "commentCount": 10,
        "diggCount": 1818,
        "playCount": 32000,
        "shareCount": 39,
        "engagementRate": 0.05834375
      },
      "index": 357
    },
    {
      "id": "7155924518526291246",
      "text": " every time i open up the pain if you're experiencing pain when doing straight bar curls, try switching to an easy bar the hand positioning is much more natural putting less strain on your forearms",
      "stats": {
        "commentCount": 41,
        "diggCount": 2572,
        "playCount": 46000,
        "shareCount": 41,
        "engagementRate": 0.057695652173913044
      },
      "index": 358
    },
    {
      "id": "7119842703063436587",
      "text": " Maxing out machines at Planet Fitness.",
      "stats": {
        "commentCount": 61,
        "diggCount": 12500,
        "playCount": 218600,
        "shareCount": 33,
        "engagementRate": 0.05761207685269899
      },
      "index": 359
    },
    {
      "id": "7120961185670827306",
      "text": " Maxing out machines at Planet Fitness.",
      "stats": {
        "commentCount": 16,
        "diggCount": 1711,
        "playCount": 30600,
        "shareCount": 29,
        "engagementRate": 0.05738562091503268
      },
      "index": 360
    },
    {
      "id": "7158118439012371755",
      "text": " barbell curl. This puts so much unnecessary pressure on your forearms and- While I do prefer doing curls with an easy bar, there is nothing wrong doing them with a straight bar as long as it's not causing you pain.",
      "stats": {
        "commentCount": 23,
        "diggCount": 2252,
        "playCount": 40400,
        "shareCount": 31,
        "engagementRate": 0.05707920792079208
      },
      "index": 361
    },
    {
      "id": "7096177458709368106",
      "text": " One of the worst exercises in my opinion.",
      "stats": {
        "commentCount": 24,
        "diggCount": 676,
        "playCount": 12400,
        "shareCount": 4,
        "engagementRate": 0.0567741935483871
      },
      "index": 362
    },
    {
      "id": "7130337452996267307",
      "text": " Today we're doing bicep exercise tier list part 2. First up we have cable curls. I'm going to go ahead and put this in A tier. Great bicep exercise, very similar movement to the incline curl, I just prefer those more. Next up, going to have to throw waiter curls all the way in D tier. Overall not very optimal for targeting the biceps. Next up we have hammer curls, in my opinion automatic S tier. This is the only brachialis bicep exercise that you need. Easy to progressively overload and will give you an insane pump. Next up we have the spider curl. This one is a well deserved A tier. A lot of the time people struggle keeping their elbow locked in place when doing bicep curls. The spider curl eliminates that problem and allows for great isolation on both heads of the bicep. Next up we have the standing barbell curl. Going to go ahead and throw that in B tier. Great overall exercise, I would put it in A but I do prefer the easy bar curl better just because of the hand positioning. Let me know in the comments what muscle group you want to see me do next.",
      "stats": {
        "commentCount": 35,
        "diggCount": 1619,
        "playCount": 30000,
        "shareCount": 43,
        "engagementRate": 0.05656666666666667
      },
      "index": 363
    },
    {
      "id": "7119855850696559914",
      "text": " the only three quad exercises you will ever need. There were a lot of people surprised in this dude's comments because he didn't include a standard barbell squat. I've said it time and time again, you do not need a squat in order to build big quads. I personally dealt with on and off severe joint pain for the last few years trying to perfect my four month squat which was hindering my ability to actually train my legs optimally. The second I gave up squatting for heavy leg press, my legs blew up like crazy. What works for some does not always work for others. Don't feel pressure to hold onto an exercise just because people tell you to.",
      "stats": {
        "commentCount": 10,
        "diggCount": 860,
        "playCount": 16100,
        "shareCount": 33,
        "engagementRate": 0.05608695652173913
      },
      "index": 364
    },
    {
      "id": "7068732052782189867",
      "text": " the most overrated exercise in my opinion.",
      "stats": {
        "commentCount": 51,
        "diggCount": 1056,
        "playCount": 20200,
        "shareCount": 15,
        "engagementRate": 0.055544554455445545
      },
      "index": 365
    },
    {
      "id": "7134730885408034091",
      "text": " If you're tired of bony shoulders and can't feel your delts doing lateral raises, other than just pulling your arms straight out to your sides, you actually want to lean forward a bit, retracting your scapula back and putting a slight bend in your arms. This is going to take tension off the traps and focus more on your delts.",
      "stats": {
        "commentCount": 21,
        "diggCount": 1301,
        "playCount": 24300,
        "shareCount": 27,
        "engagementRate": 0.05551440329218107
      },
      "index": 366
    },
    {
      "id": "7071409245031550254",
      "text": " Which is more aesthetic?",
      "stats": {
        "commentCount": 85,
        "diggCount": 1030,
        "playCount": 20700,
        "shareCount": 18,
        "engagementRate": 0.05473429951690821
      },
      "index": 367
    },
    {
      "id": "7147683097536924970",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 43,
        "diggCount": 1721,
        "playCount": 33400,
        "shareCount": 52,
        "engagementRate": 0.05437125748502994
      },
      "index": 368
    },
    {
      "id": "7162903480166812970",
      "text": " Hey check this out. All right. Let's see it first ones chest upper chest video Chest upper chest and front delts chest now you're pretty much just incorporating front delts from here on out shoulders shoulders",
      "stats": {
        "commentCount": 12,
        "diggCount": 2512,
        "playCount": 47500,
        "shareCount": 34,
        "engagementRate": 0.05385263157894737
      },
      "index": 369
    },
    {
      "id": "7093215501995855146",
      "text": " Thanks for watching!",
      "stats": {
        "commentCount": 13,
        "diggCount": 299,
        "playCount": 6151,
        "shareCount": 18,
        "engagementRate": 0.05364981303853032
      },
      "index": 370
    },
    {
      "id": "7119848479836425514",
      "text": " Have you? Have you?",
      "stats": {
        "commentCount": 8,
        "diggCount": 1421,
        "playCount": 27700,
        "shareCount": 24,
        "engagementRate": 0.052454873646209384
      },
      "index": 371
    },
    {
      "id": "7111322065847995694",
      "text": " Am I tripping? Or are these fake weights?",
      "stats": {
        "commentCount": 48,
        "diggCount": 505,
        "playCount": 11000,
        "shareCount": 21,
        "engagementRate": 0.05218181818181818
      },
      "index": 372
    },
    {
      "id": "7127340406571830571",
      "text": " She threw her little bit. Half past 12, I was all alone. There is no such thing as an anabolic window, so you can stop chugging protein shakes after your workout. But that leads to the question, when should you consume your protein? Well, if you wanna maximize muscle protein synthesis, it would be helpful to consume protein every two to three hours. It's okay to go over three hours, but you generally wanna spread your protein out throughout the day.",
      "stats": {
        "commentCount": 14,
        "diggCount": 924,
        "playCount": 18600,
        "shareCount": 31,
        "engagementRate": 0.052096774193548384
      },
      "index": 373
    },
    {
      "id": "7145143912217185579",
      "text": " Only thing bulking is, I would say makes sense if you're like literally a Minecraft skeleton. A question I literally get all the time is should I bulk or should I cut? If you are not satisfied with your current amount of muscle mass, you should absolutely be bulking. While I know it is technically still possible to gain muscle in a caloric deficit, you are severely hindering the amount of muscle gains you can make by doing so.",
      "stats": {
        "commentCount": 25,
        "diggCount": 1671,
        "playCount": 33500,
        "shareCount": 39,
        "engagementRate": 0.051791044776119406
      },
      "index": 374
    },
    {
      "id": "7112454368703663406",
      "text": " Here's how you can tell if you have good or bad chest genetics for aesthetics. So an example of somebody with bad chest genetics would be Tristan Lee. This is because he has a large gap in between where his chest inserts to the sternum and it makes his chest look less full and developed. Reason why a lot of people like Alex Eubanks physique is because his chest inserts all the way to the sternum to where he doesn't have that gap in the middle. Even if you don't have the best chest genetics, putting on overall size will take your physique to the next level.",
      "stats": {
        "commentCount": 118,
        "diggCount": 20800,
        "playCount": 408000,
        "shareCount": 58,
        "engagementRate": 0.05141176470588235
      },
      "index": 375
    },
    {
      "id": "7124357642440559918",
      "text": " You can't train biceps everyday because you gotta let your biceps rest, recover, and grow. You should never train any muscle group every single day. Your muscles need enough time to recover and rebuild themselves. And ironically, overtraining the muscle could actually hinder your growth rather than help boost brotherhood.",
      "stats": {
        "commentCount": 364,
        "diggCount": 25100,
        "playCount": 501100,
        "shareCount": 178,
        "engagementRate": 0.05117142286968669
      },
      "index": 376
    },
    {
      "id": "7149925680535571758",
      "text": " I don't think the lat pulldown was ever questioned for being not optimal, but rather that any back exercise where your arms are moving in the frontal plane is going to target more of the upper back and teres muscles, which is great for building a V-taper. But if you wanted to target the lat specifically, you'd be much better off going with rowing movements.",
      "stats": {
        "commentCount": 17,
        "diggCount": 3325,
        "playCount": 66100,
        "shareCount": 27,
        "engagementRate": 0.05096822995461422
      },
      "index": 377
    },
    {
      "id": "7080674575960378667",
      "text": " One of the worst exercises in my opinion.",
      "stats": {
        "commentCount": 77,
        "diggCount": 1479,
        "playCount": 31600,
        "shareCount": 25,
        "engagementRate": 0.05003164556962025
      },
      "index": 378
    },
    {
      "id": "7138859412650888494",
      "text": " Number one bicep exercise that we use at garage strength. Isometric holds are not optimal for muscle growth and you're 100% better off just doing center bicep curls.",
      "stats": {
        "commentCount": 11,
        "diggCount": 729,
        "playCount": 15200,
        "shareCount": 19,
        "engagementRate": 0.04993421052631579
      },
      "index": 379
    },
    {
      "id": "7147678282308226346",
      "text": " bench press is the best upper body exercise that should be- Coming from somebody who benches regularly for fun, the bench press is not an absolutely necessary exercise that you need to have in order to build a massive chest, especially if you're incorporating incline dumbbell press and other machine chest press variations. It's fun, it can help with strength, but there are plenty other exercises if it's not for you.",
      "stats": {
        "commentCount": 13,
        "diggCount": 1609,
        "playCount": 33300,
        "shareCount": 28,
        "engagementRate": 0.04954954954954955
      },
      "index": 380
    },
    {
      "id": "7070660847370243374",
      "text": "",
      "stats": {
        "commentCount": 97,
        "diggCount": 519,
        "playCount": 13100,
        "shareCount": 20,
        "engagementRate": 0.04854961832061069
      },
      "index": 381
    },
    {
      "id": "7162220942033161514",
      "text": " I know you can't bring me up Put a dehandle attachment on this machine. You will literally have the best lack contraction of your life.",
      "stats": {
        "commentCount": 70,
        "diggCount": 6070,
        "playCount": 130500,
        "shareCount": 54,
        "engagementRate": 0.04746360153256705
      },
      "index": 382
    },
    {
      "id": "7070290473033698603",
      "text": " Which is more aesthetic?",
      "stats": {
        "commentCount": 333,
        "diggCount": 11000,
        "playCount": 251800,
        "shareCount": 86,
        "engagementRate": 0.0453494837172359
      },
      "index": 383
    },
    {
      "id": "7091348921531944238",
      "text": " You should absolutely chase aesthetics even if you have a wide waist. Luckily I was blessed with a 29 inch waist but I have friends who are in that mid 30 section. If you're one of these people with larger waist all you have to do is train your chest, shoulders, and lats a lot more. This is gonna bring out that V taper that everybody wants and make your waist appear more narrow than it actually is.",
      "stats": {
        "commentCount": 20,
        "diggCount": 548,
        "playCount": 13100,
        "shareCount": 25,
        "engagementRate": 0.04526717557251908
      },
      "index": 384
    },
    {
      "id": "7144022529127107883",
      "text": " interested to look like you lift, we need to use the deadlift. The reality is deadlifts aren't gonna make or break your physique. If they're fun for you and you enjoy doing them, go for it. If it's an exercise that's been causing you pain and doesn't really fit in your routine, I would not hold on to them. I was able to take my legs this far without doing a single deadlift.",
      "stats": {
        "commentCount": 9,
        "diggCount": 627,
        "playCount": 14900,
        "shareCount": 27,
        "engagementRate": 0.044496644295302014
      },
      "index": 385
    },
    {
      "id": "7088810602507963694",
      "text": " I had quite a few people asking me what gyno was in the last video. Basically, it's just the development of breast tissue in males. A lot of times it does come through puberty through high estrogen levels, but it can also be a sign of steroid and PDU. So in this case right here, this dude just has puffier nipples and it's a very mild case of gyno. But in more severe cases, it can actually develop into a mass, a hard mass that's behind the nipple.",
      "stats": {
        "commentCount": 11,
        "diggCount": 210,
        "playCount": 5707,
        "shareCount": 27,
        "engagementRate": 0.043455405642193794
      },
      "index": 386
    },
    {
      "id": "7086184496747384106",
      "text": " Full stack. A lot of people say I wasn't fully extended so here we go, full stack. It's just so easy bro, I'm about to kidnap. I told y'all bro.",
      "stats": {
        "commentCount": 143,
        "diggCount": 10200,
        "playCount": 239600,
        "shareCount": 32,
        "engagementRate": 0.04330133555926544
      },
      "index": 387
    },
    {
      "id": "7143264532687899946",
      "text": " You're so awesome, dude! Hahaha! Should you be taking Ashwagandha if you want to make some serious gains in the gym? The answer is no. Ashwagandha or any other supplement claiming to boost testosterone are, in my opinion, a waste of money and are going to make little to no changes to your physique. You would exponentially make more gains from just taking pre-workout protein powder or creatine instead.",
      "stats": {
        "commentCount": 33,
        "diggCount": 1470,
        "playCount": 39900,
        "shareCount": 41,
        "engagementRate": 0.03869674185463659
      },
      "index": 388
    },
    {
      "id": "7164485284044983598",
      "text": " Do you have bad bicep genetics? Well it comes down to how far your bicep actually inserts towards the forearm. You can check this by seeing how many fingers you can fit in between that space. The larger that gap is, the harder it is to make the arms look overall fuller in appearance. However, you can still build amazing arms even with this type of insertion.",
      "stats": {
        "commentCount": 234,
        "diggCount": 6492,
        "playCount": 183100,
        "shareCount": 80,
        "engagementRate": 0.037170944838885854
      },
      "index": 389
    },
    {
      "id": "7073639672395713834",
      "text": " Which is most aesthetic?",
      "stats": {
        "commentCount": 96,
        "diggCount": 811,
        "playCount": 30500,
        "shareCount": 28,
        "engagementRate": 0.030655737704918033
      },
      "index": 390
    },
    {
      "id": "7159263862473198890",
      "text": " i did not have sean right there, i fucking would have broke my arm accidents like these can be completely avoided that's by tucking your elbows inwards instead of flaring them out it also feels way more comfortable",
      "stats": {
        "commentCount": 40,
        "diggCount": 4391,
        "playCount": 148700,
        "shareCount": 57,
        "engagementRate": 0.030181573638197713
      },
      "index": 391
    }
  ]
}